{"authors": [{"first": "Jung Il", "last": "Choi"}, {"first": "Mayank", "last": "Jain"}, {"first": "Kannan", "last": "Srinivasan"}, {"first": "Phil", "last": "Levis"}, {"first": "Sachin", "last": "Katti"}], "title": "Achieving Single Channel, Full Duplex Wireless Communication", "year": "2010", "isbn": "9781450301817", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/1859995.1859997", "doi": "10.1145/1859995.1859997", "abstract": "This paper discusses the design of a single channel full-duplex wireless transceiver. The design uses a combination of RF and baseband techniques to achieve full-duplexing with minimal effect on link reliability. Experiments on real nodes show the full-duplex prototype achieves median performance that is within 8% of an ideal full-duplexing system.This paper presents Antenna Cancellation, a novel technique for self-interference cancellation. In conjunction with existing RF interference cancellation and digital baseband interference cancellation, antenna cancellation achieves the amount of self-interference cancellation required for full-duplex operation.The paper also discusses potential MAC and network gains with full-duplexing. It suggests ways in which a full-duplex system can solve some important problems with existing wireless systems including hidden terminals, loss of throughput due to congestion, and large end-to-end delays.", "tags": ["self-interference cancellation", "full-duplex operation", "antenna cancellation", "median performance", "link reliability", "digital baseband", "hidden terminals", "full-duplexing", "minimal effect", "potential mac", "network gains", "cancellation", "experiments", "conjunction", "techniques", "real nodes", "throughput", "congestion", "ways", "loss", "end", "rf"], "booktitle": "Proceedings of the Sixteenth Annual International Conference on Mobile Computing and Networking", "numpages": "12", "keywords": ["wireless full-duplex"], "location": "Chicago, Illinois, USA", "series": "MobiCom '10"}