{"authors": [{"first": "Soonwon", "last": "Ka"}, {"first": "Tae Hyun", "last": "Kim"}, {"first": "Jae Yeol", "last": "Ha"}, {"first": "Sun Hong", "last": "Lim"}, {"first": "Su Cheol", "last": "Shin"}, {"first": "Jun Won", "last": "Choi"}, {"first": "Chulyoung", "last": "Kwak"}, {"first": "Sunghyun", "last": "Choi"}], "title": "Near-Ultrasound Communication for TV's 2nd Screen Services", "year": "2016", "isbn": "9781450342261", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/2973750.2973774", "doi": "10.1145/2973750.2973774", "abstract": "In this paper, we propose a near-ultrasound chirp signal-based communication for the TV's 2nd screen services. While near-ultrasound (with under 20 kHz frequency) communication has been developed for various applications recently, none of the previous work provides a perfect solution for 2nd screen services between TVs and smart devices. This is due mainly to the following real world challenges. The embedded signal in TV contents should be successfully received in a typical TV-watching environment by (i) delivering information at least at 15 bps with significantly low volume to avoid human perception, (ii) despite the presence of ambient noise, e.g., a tick, a snap, or a knock. To fulfill (i), we design chirp quaternary orthogonal keying (QOK) symbols. Especially, we aim to minimize inter-symbol interference (ISI) effects by symbol design in order to completely eliminate guard intervals. To resolve (ii), we propose the novel J-shape detection algorithms for both frame synchronization and carrier sensing. The proposed modem achieves almost zero frame error rate on a smartphone 2.7 m away from the TV even with minimal receive sound pressure level of 35 dBSPL, i.e., the noise level in a very quiet room. Moreover, throughout experiments and log analysis of 2nd screen service deployed in a nation-wide TV broadcasting system, J-shape detection algorithms are proven to achieve highly resilient performance for both frame synchronization and carrier sensing compared to previous schemes.", "booktitle": "Proceedings of the 22nd Annual International Conference on Mobile Computing and Networking", "numpages": "13", "keywords": ["near-ultrasound communication", "carrier sensing", "smartphones", "chirp signal", "frame synchronization"], "location": "New York City, New York", "series": "MobiCom '16"}