{"authors": [{"first": "Ju", "last": "Wang"}, {"first": "Hongbo", "last": "Jiang"}, {"first": "Jie", "last": "Xiong"}, {"first": "Kyle", "last": "Jamieson"}, {"first": "Xiaojiang", "last": "Chen"}, {"first": "Dingyi", "last": "Fang"}, {"first": "Binbin", "last": "Xie"}], "title": "LiFS: Low Human-Effort, Device-Free Localization with Fine-Grained Subcarrier Information", "year": "2016", "isbn": "9781450342261", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/2973750.2973776", "doi": "10.1145/2973750.2973776", "abstract": "Device-free localization of people and objects indoors not equipped with radios is playing a critical role in many emerging applications. This paper presents an accurate model-based device-free localization system LiFS, implemented on cheap commercial off-the-shelf (COTS) Wi-Fi devices. Unlike previous COTS device-based work, LiFS is able to localize a target accurately without offline training. The basic idea is simple: channel state information (CSI) is sensitive to a target's location and by modelling the CSI measurements of multiple wireless links as a set of power fading based equations, the target location can be determined. However, due to rich multipath propagation indoors, the received signal strength (RSS) or even the fine-grained CSI can not be easily modelled. We observe that even in a rich multipath environment, not all subcarriers are affected equally by multipath reflections. Our pre-processing scheme tries to identify the subcarriers not affected by multipath. Thus, CSIs on the \"clean\" subcarriers can be utilized for accurate localization.We design, implement and evaluate LiFS with extensive experiments in three different environments. Without knowing the majority transceivers' locations, LiFS achieves a median accuracy of 0.5 m and 1.1 m in line-of-sight (LoS) and non-line-of-sight (NLoS) scenarios respectively, outperforming the state-of-the-art systems. Besides single target localization, LiFS is able to differentiate two sparsely-located targets and localize each of them at a high accuracy.", "booktitle": "Proceedings of the 22nd Annual International Conference on Mobile Computing and Networking", "numpages": "14", "keywords": ["device-free localization", "channel state information", "multipath", "power fading model", "low human-effort"], "location": "New York City, New York", "series": "MobiCom '16"}