{"authors": [{"first": "Han", "last": "Zou"}, {"first": "Yuxun", "last": "Zhou"}, {"first": "Hao", "last": "Jiang"}, {"first": "Baoqi", "last": "Huang"}, {"first": "Lihua", "last": "Xie"}, {"first": "Costas", "last": "Spanos"}], "title": "A Transfer Kernel Learning Based Strategy for Adaptive Localization in Dynamic Indoor Environments: Poster", "year": "2016", "isbn": "9781450342261", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/2973750.2985278", "doi": "10.1145/2973750.2985278", "abstract": "Existing WiFi fingerprinting-based Indoor Positioning System (IPS) suffers from the vulnerability of environmental dynamics. To address this issue, we propose TKL-WinSMS as a systematic strategy, which is able to realize robust and adaptive localization in dynamic indoor environments. We developed a WiFi-based Non-intrusive Sensing and Monitoring System (WinSMS) that enables COTS WiFi routers as online reference points by extracting real-time RSS readings among them. With these online data and labeled source data from the offline calibrated radio map, we further combine the RSS readings from target mobile devices as unlabeled target data, to design a robust localization model using an emerging transfer learning algorithm, namely transfer kernel learning (TKL). It can learn a domain-invariant kernel by directly matching the source and target distributions in the reproducing kernel Hilbert space instead of the raw noisy signal space. By leveraging the resultant kernel as input for the SVR training, the trained localization model can inherit the information from online phase to adaptively enhance the offline calibrated radio map. Extensive experimental results verify the superiority of TKL-WinSMS in terms of localization accuracy compared with existing solutions in dynamic indoor environments.", "booktitle": "Proceedings of the 22nd Annual International Conference on Mobile Computing and Networking", "numpages": "3", "keywords": ["transfer learning", "IEEE 802.11 WLAN", "localization"], "location": "New York City, New York", "series": "MobiCom '16"}