{"authors": [{"first": "Qian", "last": "Wang"}, {"first": "Kui", "last": "Ren"}, {"first": "Man", "last": "Zhou"}, {"first": "Tao", "last": "Lei"}, {"first": "Dimitrios", "last": "Koutsonikolas"}, {"first": "Lu", "last": "Su"}], "title": "Messages behind the Sound: Real-Time Hidden Acoustic Signal Capture with Smartphones", "year": "2016", "isbn": "9781450342261", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/2973750.2973765", "doi": "10.1145/2973750.2973765", "abstract": "With the ever-increasing use of smart devices, recent research endeavors have led to unobtrusive screen-camera communication channel designs, which allow simultaneous screen viewing and hidden screen-camera communication. Such practices, albeit innovative and effective, require well-controlled alignment of camera and screen and obstacle-free access.In this paper, we develop Dolphin, a novel form of real-time acoustics-based dual-channel communication, which uses a speaker and the microphones on off-the-shelf smartphones to achieve concurrent audible and hidden communication. By leveraging masking effects of the human auditory system and readily available audio signals in our daily lives, Dolphin ensures real-time unobtrusive speaker-microphone data communication without affecting the primary audio-hearing experience for human users, while, at the same time, it overcomes the main limitations of existing screen-camera links. Our Dolphin prototype, built using off-the-shelf smartphones, realizes real-time hidden communication, supports up to 8-meter signal capture distance and ±90° listening angle and achieves decoding rate above 80% without error correction. Further, it achieves average data rates of up to 500bps while keeping the decoding rate above 95% within a distance of 1m.", "booktitle": "Proceedings of the 22nd Annual International Conference on Mobile Computing and Networking", "numpages": "13", "keywords": ["hidden audible communication", "dual-mode communication", "speaker-microphone communication"], "location": "New York City, New York", "series": "MobiCom '16"}