{"authors": [{"first": "Meng", "last": "Niu"}, {"first": "Bo", "last": "Cheng"}, {"first": "Zhongyi", "last": "Zhai"}, {"first": "Yimeng", "last": "Feng"}, {"first": "Junliang", "last": "Chen"}], "title": "Poster: Docker-Based Self-Organizing IoT Services Architecture for Smarthome", "year": "2017", "isbn": "9781450349284", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3081333.3089297", "doi": "10.1145/3081333.3089297", "abstract": "Internet of Things(IoT) was first coined in 1999 by Kevin Ashton. However with the technologies advancement, it seems that intelligent devices will invisibly be embedded in our life in few years. Enormous amounts of data need be exchanged every seconds. It calls for a seamless effect and easily interpretable communicating architecture. The research proposal will try to address some challenges and possible path in IoT enabled smarthome. It focuses primarily on two categories. Firstly, devices in IoT field is always distributed. So, there is a distributed IoT services architecture instead of traditional control-center solution. However, those devices are also limited in a certain area (such as a home local network). In order to reduce delay and burden, those distributed devices collect context information though a self-organizing broadcast network, and determine their next action based on that context data. Secondly, using Docker (a lightweight hardware-agnostic and platform-agnostic container) to package services. In our smarthome network, IoT services are distributed across different home electronics. Docker shields all the differences, so that we can quickly deploy and update module in the smarthome network after purchasing new electronics.", "booktitle": "Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "1", "keywords": ["internet of thing", "IoT service", "self-organizing", "docker"], "location": "Niagara Falls, New York, USA", "series": "MobiSys '17"}