{"authors": [{"first": "Sijie", "last": "Xiong"}, {"first": "Sujie", "last": "Zhu"}, {"first": "Yisheng", "last": "Ji"}, {"first": "Binyao", "last": "Jiang"}, {"first": "Xiaohua", "last": "Tian"}, {"first": "Xuesheng", "last": "Zheng"}, {"first": "Xinbing", "last": "Wang"}], "title": "IBlink: Smart Glasses for Facial Paralysis Patients", "year": "2017", "isbn": "9781450349284", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3081333.3081343", "doi": "10.1145/3081333.3081343", "abstract": "Facial paralysis makes patients lose their facial movements, which can incur eye damage even blindness since patients are incapable of blinking. The paralysis usually occurs on just one side of the face, and clinical trials show that electrical stimulation could trigger blink. Based on such observations, we design and implement a pair of smart glasses iBlink to assist facial paralysis patients to blink. The basic idea is to monitor the normal side of the face with a camera and stimulate the paralysed side, so that the blink of the both eyes become symmetric. To the best of our knowledge, this is the first piece of wearable device for facial paralysis therapy. Our contributions are: First, we propose an eye-blink detection mechanism based on deep convolutional neural network (CNN), which can detect asymmetric blinks of patients under various illumination conditions with an accuracy above 99%. Our eye-image library for training CNN models is published online for further related studies, which contains more than $30,000$ eye images. Second, we design and implement an automatic stimulation circuits to generate electrical impulse for stimulating the patient's facial nerve branches, which can configure operational parameters in a self-adaptive manner for different patients. Third, we implement the entire iBlink system, which integrates the two functions above and a communication function module for tele-medicine applications. Moreover, we conduct clinical trials in a hospital, in order to obtain the design basis and verify effectiveness of our device.", "booktitle": "Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "12", "keywords": ["smart glasses", "facial paralysis"], "location": "Niagara Falls, New York, USA", "series": "MobiSys '17"}