{"authors": [{"first": "Saman", "last": "Naderiparizi"}, {"first": "Pengyu", "last": "Zhang"}, {"first": "Matthai", "last": "Philipose"}, {"first": "Bodhi", "last": "Priyantha"}, {"first": "Jie", "last": "Liu"}, {"first": "Deepak", "last": "Ganesan"}], "title": "Glimpse: A Programmable Early-Discard Camera Architecture for Continuous Mobile Vision", "year": "2017", "isbn": "9781450349284", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3081333.3081347", "doi": "10.1145/3081333.3081347", "abstract": "We consider the problem of continuous computer-vision based analysis of video streams from mobile cameras over extended periods. Given high computational demands, general visual processing must currently be offloaded to the cloud. To reduce mobile battery and bandwidth consumption, recent proposals offload only \"interesting\" video frames, discarding the rest. However, determining what to discard is itself typically a power-hungry computer vision calculation, very often well beyond what most mobile devices can afford on a continuous basis. We present the Glimpse system, a re-design of the conventional mobile video processing pipeline to support such \"early discard\" flexibly, efficiently and accurately. Glimpse is a novel architecture that gates wearable vision using low-power vision modalities. Our proposed architecture adds novel sensing, processing, algorithmic and programming-system components to the camera pipeline to this end. We present a complete implementation and evaluation of our design. In common settings, Glimpse reduces mobile power and data usage by more than one order of magnitude relative to earlier designs, and moves continuous vision on lightweight wearables to the realm of the practical.", "booktitle": "Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "14", "keywords": ["continuous mobile vision", "energy efficient wearable vision system", "low-power early discard", "low-power vision modalities"], "location": "Niagara Falls, New York, USA", "series": "MobiSys '17"}