{"authors": [{"first": "Bing", "last": "Zhou"}, {"first": "Mohammed", "last": "Elbadry"}, {"first": "Ruipeng", "last": "Gao"}, {"first": "Fan", "last": "Ye"}], "title": "BatMapper: Acoustic Sensing Based Indoor Floor Plan Construction Using Smartphones", "year": "2017", "isbn": "9781450349284", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3081333.3081363", "doi": "10.1145/3081333.3081363", "abstract": "The lack of digital floor plans is a huge obstacle to pervasive indoor location based services (LBS). Recent floor plan construction work crowdsources mobile sensing data from smartphone users for scalability. However, they incur long time (e.g., weeks or months) and tremendous efforts in data collection, and many rely on images thus suffering technical and privacy limitations. In this paper, we propose BatMapper, which explores a previously untapped sensing modality -- acoustics -- for fast, fine grained and low cost floor plan construction. We design sound signals suitable for heterogeneous microphones on commodity smartphones, and acoustic signal processing techniques to produce accurate distance measurements to nearby objects. We further develop robust probabilistic echo-object association, recursive outlier removal and probabilistic resampling algorithms to identify the correspondence between distances and objects, thus the geometry of corridors and rooms. We compensate minute hand sway movements to identify small surface recessions, thus detecting doors automatically. Experiments in real buildings show BatMapper achieves 1-2cm distance accuracy in ranges up around 4m; a 2-3 minute walk generates fine grained corridor shapes, detects doors at 92% precision and 1~2m location error at 90-percentile; and tens of seconds of measurement gestures produce room geometry with errors &lt;0.3m at 80-percentile, at 1-2 orders of magnitude less data amounts and user efforts.", "booktitle": "Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "14", "keywords": ["acoustic sensing", "indoor floor plans"], "location": "Niagara Falls, New York, USA", "series": "MobiSys '17"}