{"authors": [{"first": "Sangeun", "last": "Oh"}, {"first": "Hyuck", "last": "Yoo"}, {"first": "Dae R.", "last": "Jeong"}, {"first": "Duc Hoang", "last": "Bui"}, {"first": "Insik", "last": "Shin"}], "title": "Mobile Plus: Multi-Device Mobile Platform for Cross-Device Functionality Sharing", "year": "2017", "isbn": "9781450349284", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3081333.3081348", "doi": "10.1145/3081333.3081348", "abstract": "In recent years, the explosion of diverse smart devices such as mobile phones, TVs, watches, and even cars, has completely changed our lives. We communicate with friends through social network services (SNSs) whenever we want, buy stuff without visiting shops, and enjoy multimedia wherever we are, thanks to these devices. However, these smart devices cannot simply interact with each other even though they are right next to each other. For example, when you want to read a PDF stored on a smartphone on a larger TV screen, you need to do complicated work or plug in a bunch of cables. In this paper, we introduce M+, an extension of Android that supports cross-device functionality sharing in a transparent manner. As a platform-level solution, M+ enables unmodified Android applications to utilize not only application functionalities but also system functionalities across devices, as if they were to utilize them inside the same device. In addition to secure connection setup, M+ also allows performing of permission checks for remote applications in the same way as for local. Our experimental results show that M+ enables transparent cross-device sharing for various functionalities and achieves performance close to that of within-device sharing unless a large amount of data is transferred.", "booktitle": "Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["inter-process communication", "functionality sharing", "remote procedure call", "multi-device mobile platform"], "location": "Niagara Falls, New York, USA", "series": "MobiSys '17"}