{"authors": [{"first": "Yuze", "last": "Huang"}, {"first": "Jiwei", "last": "Huang"}, {"first": "Bo", "last": "Cheng"}, {"first": "Tianxiang", "last": "Yao"}, {"first": "Junliang", "last": "Chen"}], "title": "Poster: Interacting Data-Intensive Services Mining and Placement in Mobile Edge Clouds", "year": "2017", "isbn": "9781450349161", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3117811.3131263", "doi": "10.1145/3117811.3131263", "abstract": "With the rapid growth of cloud computing and mobile computing, it is commonplace for users to request cloud services from mobile devices. Mobile edge clouds (MECs) allow the users to access the cloud services seamlessly. Although cloudlets provide a promising technique to reduce the service access latency, how to place the data-intensive service in MECs to reduce the communication overhead between different services is yet to be addressed. To attack this challenge, this paper proposes an approach for mining interacting services and placing the services on the cloudlets by optimizing the communication overhead. In this approach, a frequent itemsets mining algorithm is proposed to obtain the fine-grained frequent 2-itemsets by analyzing the cookies. This algorithm determines the minimum support threshold automatically, based on which FP-tree with FP-matrix is constructed to avoid traversing the FP-tree during the process of frequent 2-itemsets discovery, then a searching algorithm is presented to mine the discriminative frequent 2-itemsets with interestingness measure. Furthermore, the communication overhead is optimized with the capacity constraints of cloudlets. Finally, we validate the efficacy of our approach by real-world data based simulations. The results show our approach can reduce the communication overhead for service placement in MECs.", "booktitle": "Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking", "numpages": "3", "keywords": ["data-intensive service", "service placement", "mobile edge clouds", "interacting services"], "location": "Snowbird, Utah, USA", "series": "MobiCom '17"}