{"authors": [{"first": "Xenofon", "last": "Foukas"}, {"first": "Mahesh K.", "last": "Marina"}, {"first": "Kimon", "last": "Kontovasilis"}], "title": "Orion: RAN Slicing for a Flexible and Cost-Effective Multi-Service Mobile Network Architecture", "year": "2017", "isbn": "9781450349161", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3117811.3117831", "doi": "10.1145/3117811.3117831", "abstract": "Emerging 5G mobile networks are envisioned to become multi-service environments, enabling the dynamic deployment of services with a diverse set of performance requirements, accommodating the needs of mobile network operators, verticals and over-the-top (OTT) service providers. Virtualizing the mobile network in a flexible way is of paramount importance for a cost-effective realization of this vision. While virtualization has been extensively studied in the case of the mobile core, virtualizing the radio access network (RAN) is still at its infancy. In this paper, we present Orion, a novel RAN slicing system that enables the dynamic on-the-fly virtualization of base stations, the flexible customization of slices to meet their respective service needs and which can be used in an end-to-end network slicing setting. Orion guarantees the functional and performance isolation of slices, while allowing for the efficient use of RAN resources among them. We present a concrete prototype implementation of Orion for LTE, with experimental results, considering alternative RAN slicing approaches, indicating its efficiency and highlighting its isolation capabilities. We also present an extension to Orion for accommodating the needs of OTT providers.", "booktitle": "Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking", "numpages": "14", "keywords": ["network architecture", "RAN virtualization", "RAN slicing", "abstractions", "5G mobile networks"], "location": "Snowbird, Utah, USA", "series": "MobiCom '17"}