{"authors": [{"first": "Max", "last": "Curran"}, {"first": "Md. Shaifur", "last": "Rahman"}, {"first": "Himanshu", "last": "Gupta"}, {"first": "Kai", "last": "Zheng"}, {"first": "Jon", "last": "Longtin"}, {"first": "Samir R.", "last": "Das"}, {"first": "Thanvir", "last": "Mohamed"}], "title": "FSONet: A Wireless Backhaul for Multi-Gigabit Picocells Using Steerable Free Space Optics", "year": "2017", "isbn": "9781450349161", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3117811.3129239", "doi": "10.1145/3117811.3129239", "abstract": "Expected increase in cellular demand has pushed recent interest in picocell networks which have reduced cell sizes (100-200m or less). For ease of deployment of such networks, a wireless backhaul network is highly desired. Since RF-based technologies are unlikely to provide the desired multi-gigabit data rates, we motivate and explore use of free space optics (FSO) for picocell backhaul. In particular, we present a novel network architecture based on steerable links and sufficiently many robust short-range links, to help circumvent the key challenge of outdoor effects in reliable operation of outdoor FSO links. Our architecture is motivated by the fact that, due to the high density of picocells, many short-range links will occur naturally in a picocell backhaul. Moreover, use of steerable FSO links facilitates networks with sufficient redundancy while using only a small number of interfaces per node. We address the key problems that arise in the context of such a backhaul architecture, viz., an FSO link design with desired characteristics, and related network design and management problems. We develop and evaluate a robust 100m FSO link prototype, and simulate the proposed architecture in many metro US cities while show its viability via evaluation of key performance metrics.", "booktitle": "Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking", "numpages": "13", "keywords": ["free space optics", "small cells", "backhaul", "reconfigurable networks"], "location": "Snowbird, Utah, USA", "series": "MobiCom '17"}