{"authors": [{"first": "Mojgan", "last": "Khaledi"}, {"first": "Mehrdad", "last": "Khaledi"}, {"first": "Shamik", "last": "Sarkar"}, {"first": "Sneha", "last": "Kasera"}, {"first": "Neal", "last": "Patwari"}, {"first": "Kurt", "last": "Derr"}, {"first": "Samuel", "last": "Ramirez"}], "title": "Simultaneous Power-Based Localization of Transmitters for Crowdsourced Spectrum Monitoring", "year": "2017", "isbn": "9781450349161", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3117811.3117845", "doi": "10.1145/3117811.3117845", "abstract": "The current mechanisms for locating spectrum offenders are time consuming, human-intensive, and expensive. In this paper, we propose a novel approach to locate spectrum offenders using crowdsourcing. In such a participatory sensing system, privacy and bandwidth concerns preclude distributed sensing devices from reporting raw signal samples to a central agency; instead, devices would be limited to measurements of received power. However, this limitation enables a smart attacker to evade localization by simultaneously transmitting from multiple infected devices. Existing localization methods are insufficient or incapable of locating multiple sources when the powers from each source cannot be separated at the receivers. In this paper, we first propose a simple and efficient method that simultaneously locates multiple transmitters using the received power measurements from the selected devices. Second, we build sampling approaches to select sensing devices required for localization. Next, we enhance our sampling to also take into account incentives for participation in crowdsourcing. We experimentally evaluate our localization framework under a variety of settings and find that we are able to localize multiple sources transmitting simultaneously with reasonably high accuracy in a timely manner.", "booktitle": "Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking", "numpages": "13", "keywords": ["RTL-SDR", "crowdsourcing", "smartphones", "spectrum monitoring", "incentive model", "truthfulness", "localization", "spectrum misuse", "mobility", "sampling"], "location": "Snowbird, Utah, USA", "series": "MobiCom '17"}