{"authors": [{"first": "Yang", "last": "Shen"}, {"first": "Guojun", "last": "Chen"}, {"first": "Xieyang", "last": "Xu"}, {"first": "Chenren", "last": "Xu"}, {"first": "Guobin", "last": "Shen"}, {"first": "Jiaji", "last": "Li"}], "title": "Poster: A VLC Solution for Smart Parking", "year": "2017", "isbn": "9781450349161", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3117811.3131245", "doi": "10.1145/3117811.3131245", "abstract": "With the rapid growth of vehicle ownership, parking has become an issue, especially in metropolitan areas -- the extra time for check-ins, check-outs and finding available parking spaces not only causes frustration and potential road rage on the driver side, but also increases the traffic congestion, gasoline waste and air pollution in consequence. In order to address these problems, the concept of \"smart parking\" is put forward. To make a parking lot \"smart\", we argue that three basic features, namely Vehicle Identification, Parking Space Detection and Indoor Localization are are critical and should be supported by the infrastructure. Herein, we present LightPark, a Visible Light Communication (VLC) solution to realize the vision of \"smart parking\". Building on top of the visible light backscatter communication primitive, LightPark is able to leverage the lighting infrastructure to perform scalable visible light communication and networking with the batter-free tag devices instrumented on the vehicles and parking spaces to manage the critical information such as identification and real-time location of vehicles, and status of parking spaces in a centralized and low-cost manner.", "booktitle": "Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking", "numpages": "3", "keywords": ["indoor localization", "smart parking", "backscatter", "visible light communication", "parking space detection"], "location": "Snowbird, Utah, USA", "series": "MobiCom '17"}