{"authors": [{"first": "Lu", "last": "Chen"}, {"first": "Fei", "last": "Wu"}, {"first": "Jiaqi", "last": "Xu"}, {"first": "Kannan", "last": "Srinivasan"}, {"first": "Ness", "last": "Shroff"}], "title": "BiPass: Enabling End-to-End Full Duplex", "year": "2017", "isbn": "9781450349161", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3117811.3117826", "doi": "10.1145/3117811.3117826", "abstract": "Full duplex techniques can potentially double the channel capacity and achieve lower delays by empowering two radios to simultaneously transmit in thesame frequency band.However, full duplex is only available between two adjacent nodes within the communication range. In this paper, we present BiPass to break this limitation.With the help of full duplex capable relays, weenable simultaneous bidirectional in-band cut-through transmissions between two far apart nodes, so they can do full duplex communications as if they were within each other's transmission range.To design such a system, we analyze interference patterns and propose a loop-back interference cancellation strategy. We identify the power amplification problem at relay nodes and develop an algorithm to solve it. We also develop a routing algorithm, an opportunistic forwarding scheme, and a real-time feedback strategy to leverage this system in ad-hoc networks.To evaluate the real world performance of BiPass, we build a prototype and conduct experiments using software defined radios. We show that BiPass can achieve 1.6x median throughput gain over state-of-the-art one-way cut-through systems, and 4.09x gain over the decode-and-forward scheme. Our simulations further reveal that even when the data traffic is not bidirectional, BiPass has 1.36x throughput gain and 47% delay reduction overone-way cut-through systemsin large networks.", "booktitle": "Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking", "numpages": "13", "keywords": ["multi-hop", "full duplex", "interference cancellation", "relay"], "location": "Snowbird, Utah, USA", "series": "MobiCom '17"}