{"authors": [{"first": "Han", "last": "Zou"}, {"first": "Yuxun", "last": "Zhou"}, {"first": "Jianfei", "last": "Yang"}, {"first": "Weixi", "last": "Gu"}, {"first": "Lihua", "last": "Xie"}, {"first": "Costas", "last": "Spanos"}], "title": "Poster: WiFi-Based Device-Free Human Activity Recognition via Automatic Representation Learning", "year": "2017", "isbn": "9781450349161", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3117811.3131266", "doi": "10.1145/3117811.3131266", "abstract": "Existing human activity recognition approaches require either the deployment of extra infrastructure or the cooperation of occupants to carry dedicated devices, which are expensive, intrusive and inconvenient for pervasive implementation. In this paper, we propose SmartSense, a device-free human activity recognition system based on a novel machine learning algorithm with existing commercial off-the-shelf (COTS) WiFi routers. By exploiting the prevalence of existing WiFi infrastructure in buildings, we developed a novel OpenWrt based firmware for COTS WiFi routers to collect the CSI measurements from regular data frames. To identify different human activities, an automatic kernel representation learning method, namely auto-HSRL, is established to selection informative Hilbert space patterns from time, frequency, wavelet, and shape domains. A new information fusion tool based on multi-view kernel learning is proposed to combine the representations extracted from diverse perspectives and build up a robust and comprehensive activity classifier. Extensive experiments were conducted in an office and the experimental results demonstrate that SmartSense outperforms existing methods and achieves a 98% activity recognition accuracy.", "booktitle": "Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking", "numpages": "3", "keywords": ["human activity recognition", "representation learning", "WiFi"], "location": "Snowbird, Utah, USA", "series": "MobiCom '17"}