{"authors": [{"first": "Jian", "last": "He"}, {"first": "Mubashir Adnan", "last": "Qureshi"}, {"first": "Lili", "last": "Qiu"}, {"first": "Jin", "last": "Li"}, {"first": "Feng", "last": "Li"}, {"first": "Lei", "last": "Han"}], "title": "Rubiks: Practical 360-Degree Streaming for Smartphones", "year": "2018", "isbn": "9781450357203", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3210240.3210323", "doi": "10.1145/3210240.3210323", "abstract": "The popularity of 360° videos has grown rapidly due to the immersive user experience. 360° videos are displayed as a panorama and the view automatically adapts with the head movement. Existing systems stream 360° videos in a similar way as regular videos, where all data of the panoramic view is transmitted. This is wasteful since a user only views a small portion of the 360° view. To save bandwidth, recent works propose the tile-based streaming, which divides the panoramic view to multiple smaller sized tiles and streams only the tiles within a user's field of view (FoV) predicted based on the recent head position. Interestingly, the tile-based streaming has only been simulated or implemented on desktops. We find that it cannot run in real-time even on the latest smartphone (e.g., Samsung S7, Samsung S8 and Huawei Mate 9) due to hardware and software limitations. Moreover, it results in significant video quality degradation due to head movement prediction error, which is hard to avoid. Motivated by these observations, we develop a novel tile-based layered approach to stream 360° content on smartphones to avoid bandwidth wastage while maintaining high video quality. Through real system experiments, we show our approach can achieve up to 69% improvement in user QoE and 49% in bandwidth savings over existing approaches. To the best of our knowledge, this is the first 360° streaming framework that takes into account the practical limitations of Android based smartphones.", "booktitle": "Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["Smartphones", "360° Videos", "Video Codecs", "Rate Adaptation"], "location": "Munich, Germany", "series": "MobiSys '18"}