{"authors": [{"first": "Wonjung", "last": "Kim"}, {"first": "Kenny Tsu Wei", "last": "Choo"}, {"first": "Youngki", "last": "Lee"}, {"first": "Archan", "last": "Misra"}, {"first": "Rajesh Krishna", "last": "Balan"}], "title": "Empath-D: VR-Based Empathetic App Design for Accessibility", "year": "2018", "isbn": "9781450357203", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3210240.3210331", "doi": "10.1145/3210240.3210331", "abstract": "With app-based interaction increasingly permeating all aspects of daily living, it is essential to ensure that apps are designed to be inclusive and are usable by a wider audience such as the elderly, with various impairments (e.g., visual, audio and motor). We propose Empath-D, a system that fosters empathetic design, by allowing app designers, in-situ, to rapidly evaluate the usability of their apps, from the perspective of impaired users. To provide a truly authentic experience, Empath-D carefully orchestrates the interaction between a smartphone and a VR device, allowing the user to experience simulated impairments in a virtual world while interacting naturally with the app, using a real smartphone. By carefully orchestrating the VR-smartphone interaction, Empath-D tackles challenges such as preserving low-latency app interaction, accurate visualization of hand movement and low-overhead perturbation of I/O streams. Experimental results show that user interaction with Empath-D is comparable (both in accuracy and user perception) to real-world app usage, and that it can simulate impairment effects as effectively as a custom hardware simulator.", "booktitle": "Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["empathetic design", "multi-device", "mobile design", "accessibility", "distributed user interfaces", "virtual reality"], "location": "Munich, Germany", "series": "MobiSys '18"}