{"authors": [{"first": "Jie", "last": "Zhang"}, {"first": "Zhanyong", "last": "Tang"}, {"first": "Meng", "last": "Li"}, {"first": "Dingyi", "last": "Fang"}, {"first": "Petteri", "last": "Nurmi"}, {"first": "Zheng", "last": "Wang"}], "title": "CrossSense: Towards Cross-Site and Large-Scale WiFi Sensing", "year": "2018", "isbn": "9781450359030", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3241539.3241570", "doi": "10.1145/3241539.3241570", "abstract": "We present CrossSense, a novel system for scaling up WiFi sensing to new environments and larger problems. To reduce the cost of sensing model training data collection, CrossSense employs machine learning to train, off-line, a roaming model that generates from one set of measurements synthetic training samples for each target environment. To scale up to a larger problem size, CrossSense adopts a mixture-of-experts approach where multiple specialized sensing models, or experts, are used to capture the mapping from diverse WiFi inputs to the desired outputs. The experts are trained offline and at runtime the appropriate expert for a given input is automatically chosen. We evaluate CrossSense by applying it to two representative WiFi sensing applications, gait identification and gesture recognition, in controlled single-link environments. We show that CrossSense boosts the accuracy of state-of-the-art WiFi sensing techniques from 20% to over 80% and 90% for gait identification and gesture recognition respectively, delivering consistently good performance - particularly when the problem size is significantly greater than that current approaches can effectively handle.", "booktitle": "Proceedings of the 24th Annual International Conference on Mobile Computing and Networking", "numpages": "16", "keywords": ["channel state information", "wireless sensing", "machine learning", "received signal strength indicator"], "location": "New Delhi, India", "series": "MobiCom '18"}