{"authors": [{"first": "Kai", "last": "Zhang"}, {"first": "Chenshu", "last": "Wu"}, {"first": "Chaofan", "last": "Yang"}, {"first": "Yi", "last": "Zhao"}, {"first": "Kehong", "last": "Huang"}, {"first": "Chunyi", "last": "Peng"}, {"first": "Yunhao", "last": "Liu"}, {"first": "Zheng", "last": "Yang"}], "title": "ChromaCode: A Fully Imperceptible Screen-Camera Communication System", "year": "2018", "isbn": "9781450359030", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3241539.3241543", "doi": "10.1145/3241539.3241543", "abstract": "Hidden screen-camera communication techniques emerge as a new paradigm that embeds data imperceptibly into regular videos while remaining unobtrusive to human viewers. Three key goals on imperceptible, high rate, and reliable communication are desirable but conflicting, and existing solutions usually made a trade-off among them. In this paper, we present the design and implementation of ChromaCode, a screen-camera communication system that achieves all three goals simultaneously. In our design, we consider for the first time color space for perceptually uniform lightness modifications. On this basis, we design an outcome-based adaptive embedding scheme, which adapts to both pixel lightness and regional texture. Last, we propose a concatenated code scheme for robust coding and devise multiple techniques to overcome various screen-camera channel errors. Our prototype and experiments demonstrate that ChromaCode achieves remarkable raw throughputs of &gt;700 kbps, data goodputs of 120 kbps with BER of 0.05, and with fully imperceptible flicker for viewing proved by user study, which significantly outperforms previous works.", "booktitle": "Proceedings of the 24th Annual International Conference on Mobile Computing and Networking", "numpages": "16", "keywords": ["screen-camera communication", "hidden visible communication", "non-intrusive visible communication"], "location": "New Delhi, India", "series": "MobiCom '18"}