{"authors": [{"first": "Deepak", "last": "Solanki"}], "title": "Optical Wireless Communication", "year": "2018", "isbn": "9781450359030", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3241539.3267729", "doi": "10.1145/3241539.3267729", "abstract": "Data is the new currency impacting everybody's lives. As the modern world receives &amp; sends millions of Terabytes of data every day, the present-day wireless data communication technologies comprising of Wi-Fi &amp; 4G-LTE is on the verge of becoming partially inept for information exchange as they suffer from spectrum congestion in both controlled and uncontrolled environments. Li-Fi, also known as light fidelity, is a full duplex communication network enabling transmittal of data. The potency of bidirectional Visible Light Communication allows us to build an ideal medium, independent of congested radio frequencies and interference from electromagnetic waves, thus, resulting in faster data transfer. Inception of LED technology for lighting in 90's paved the way for high growth trajectory for LED Lighting industry which we have witnessed from the last 2 decades. As semiconductors, LEDs were poised to develop much bigger applications like integrated sensors apart from normal dimming and ambient lighting. Li-Fi is a technology which creates a bridge between the world of data communication &amp; LED Lighting. Multiple forward &amp; backward integration are poised to happen in coming years when lighting players will develop enterprise communication enabled lighting products. Even system integrators will look forward to Li-Fi enabled luminaires for establishing wireless networks. Li-Fi is being seen as a big step forward in enabling 5G telecommunication networks. Security benefits and outdoor long-range communication capabilities Li-Fi a potential technology for Defence &amp; Smart Cities applications. Li-Fi uses the visible and invisible frequency band (380nm - 1500nm) which is 10,000 times broader than usable RF frequency band. The property of light spectrum to be unlicensed and free from any health regulations makes it even more desirable for us. Its applications can extend in areas where the RF technology lacks its presence like aircrafts and hospitals (operation theatres), power plants and various other areas, where electromagnetic (Radio) interference is of great concern for safety and security of equipment's and people. Since there is no potential health hazard associated with light, it can be used safely in such locations or areas. Li-Fi / OWC has applications in both indoor (≅) and outdoor ( ) scenarios.", "booktitle": "Proceedings of the 24th Annual International Conference on Mobile Computing and Networking", "numpages": "3", "keywords": ["visible light communication", "light fidelity"], "location": "New Delhi, India", "series": "MobiCom '18"}