{"authors": [{"first": "Wenjun", "last": "Jiang"}, {"first": "Chenglin", "last": "Miao"}, {"first": "Fenglong", "last": "Ma"}, {"first": "Shuochao", "last": "Yao"}, {"first": "Yaqing", "last": "Wang"}, {"first": "Ye", "last": "Yuan"}, {"first": "Hongfei", "last": "Xue"}, {"first": "Chen", "last": "Song"}, {"first": "Xin", "last": "Ma"}, {"first": "Dimitrios", "last": "Koutsonikolas"}, {"first": "Wenyao", "last": "Xu"}, {"first": "Lu", "last": "Su"}], "title": "Towards Environment Independent Device Free Human Activity Recognition", "year": "2018", "isbn": "9781450359030", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3241539.3241548", "doi": "10.1145/3241539.3241548", "abstract": "Driven by a wide range of real-world applications, significant efforts have recently been made to explore device-free human activity recognition techniques that utilize the information collected by various wireless infrastructures to infer human activities without the need for the monitored subject to carry a dedicated device. Existing device free human activity recognition approaches and systems, though yielding reasonably good performance in certain cases, are faced with a major challenge. The wireless signals arriving at the receiving devices usually carry substantial information that is specific to the environment where the activities are recorded and the human subject who conducts the activities. Due to this reason, an activity recognition model that is trained on a specific subject in a specific environment typically does not work well when being applied to predict another subject's activities that are recorded in a different environment. To address this challenge, in this paper, we propose EI, a deep-learning based device free activity recognition framework that can remove the environment and subject specific information contained in the activity data and extract environment/subject-independent features shared by the data collected on different subjects under different environments. We conduct extensive experiments on four different device free activity recognition testbeds: WiFi, ultrasound, 60 GHz mmWave, and visible light. The experimental results demonstrate the superior effectiveness and generalizability of the proposed EI framework.", "booktitle": "Proceedings of the 24th Annual International Conference on Mobile Computing and Networking", "numpages": "16", "keywords": ["human activity recognition", "device free", "environment independent"], "location": "New Delhi, India", "series": "MobiCom '18"}