{"authors": [{"first": "Anna Maria", "last": "alari"}, {"first": "Andra", "last": "Lutu"}, {"first": "Ana", "last": "Custura"}, {"first": "Ali", "last": "Safari Khatouni"}, {"first": "\\\"{O}zg\\\"{u}", "last": "Alay"}, {"first": "Marcelo", "last": "Bagnulo"}, {"first": "Vaibhav", "last": "Bajpai"}, {"first": "Anna", "last": "Brunstrom"}, {"first": "J\\\"{o}rg", "last": "Ott"}, {"first": "Marco", "last": "Mellia"}, {"first": "Gorry", "last": "Fairhurst"}], "title": "Experience: Implications of Roaming in Europe", "year": "2018", "isbn": "9781450359030", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3241539.3241577", "doi": "10.1145/3241539.3241577", "abstract": "\"Roam like Home\" is the initiative of the European Commission (EC) to end the levy of extra charges when roaming within the European region. As a result, people are able to use data services more freely across Europe. However, the implications roaming solutions have on performance have not been carefully examined. This paper provides an in-depth characterization of the implications of international data roaming within Europe. We build a unique roaming measurement platform using 16 different mobile networks deployed in six countries across Europe. Using this platform, we measure different aspects of international roaming in 3G and 4G networks, including mobile network configuration, performance characteristics, and content discrimination. We find that operators adopt common approaches to implementing roaming, resulting in additional latency penalties of ∼60 ms or more, depending on geographical distance. Considering content accessibility, roaming poses additional constraints that leads to only minimal deviations when accessing content in the original country. However, geographical restrictions in the visited country make the picture more complicated and less intuitive.", "booktitle": "Proceedings of the 24th Annual International Conference on Mobile Computing and Networking", "numpages": "11", "keywords": ["mobile networks", "roaming", "experimental testbeds", "measurement platform", "measurements"], "location": "New Delhi, India", "series": "MobiCom '18"}