{"authors": [{"first": "Swetank Kumar", "last": "Saha"}, {"first": "Shivang", "last": "Aggarwal"}, {"first": "Rohan", "last": "Pathak"}, {"first": "Dimitrios", "last": "Koutsonikolas"}, {"first": "Joerg", "last": "Widmer"}], "title": "MuSher: An Agile Multipath-TCP Scheduler for Dual-Band 802.11ad/Ac Wireless LANs", "year": "2019", "isbn": "9781450361699", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3300061.3345435", "doi": "10.1145/3300061.3345435", "abstract": "Future WLAN devices will combine both IEEE 802.11ad and 802.11ac interfaces. The former provides multi-Gbps rates but is susceptible to blockage, whereas the latter is slower but offers reliable connectivity. A fundamental challenge is thus how to combine those complementary technologies, to make the most of the advantages they offer. In this work, we explore leveraging Multipath TCP (MPTCP) to use both interfaces simultaneously in order to achieve a higher overall throughput as well as seamlessly switching to a single interface when the other one fails. We find that standard MPTCP often performs sub-optimally and may even yield a throughput much lower than that of single path TCP over the faster of the two interfaces. We analyze the cause of these performance issues in detail and then design MuSher, an agile MPTCP scheduler that allows MPTCP to fully utilize the channel resources available to both interfaces. Our evaluation in realistic scenarios shows that MuSher provides a throughput improvement of up to 1.5x/2.3x and speeds up the recovery of a traffic stream, after disruption, by a factor of up to 8x/75x, under WLAN/Internet settings respectively, compared to the default MPTCP scheduler.", "booktitle": "The 25th Annual International Conference on Mobile Computing and Networking", "numpages": "16", "keywords": ["millimeter-wave", "802.11ac", "multipath-tcp", "802.11ad", "60 ghz"], "location": "Los Cabos, Mexico", "series": "MobiCom '19"}