{"authors": [{"first": "Qifan", "last": "Yang"}, {"first": "Zhenhua", "last": "Li"}, {"first": "Yunhao", "last": "Liu"}, {"first": "Hai", "last": "Long"}, {"first": "Yuanchao", "last": "Huang"}, {"first": "Jiaming", "last": "He"}, {"first": "Tianyin", "last": "Xu"}, {"first": "Ennan", "last": "Zhai"}], "title": "Mobile Gaming on Personal Computers with Direct Android Emulation", "year": "2019", "isbn": "9781450361699", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3300061.3300122", "doi": "10.1145/3300061.3300122", "abstract": "Playing Android games on Windows x86 PCs has gained enormous popularity in recent years, and the de facto solution is to use mobile emulators built with the AOVB (Android-x86 On VirtualBox) architecture. When playing heavy 3D Android games with AOVB, however, users often suffer unsatisfactory smoothness due to the considerable overhead of full virtualization. This paper presents DAOW, a game-oriented Android emulator implementing the idea of direct Android emulation, which eliminates the overhead of full virtualization by directly executing Android app binaries on top of x86-based Windows. Based on pragmatic, efficient instruction rewriting and syscall emulation, DAOW offers foreign Android binaries direct access to the domestic PC hardware through Windows kernel interfaces, achieving nearly native hardware performance. Moreover, it leverages graphics and security techniques to enhance user experiences and prevent cheating in gaming. As of late 2018, DAOW has been adopted by over 50 million PC users to run thousands of heavy 3D Android games. Compared with AOVB, DAOW improves the smoothness by 21% on average, decreases the game startup time by 48%, and reduces the memory usage by 22%.", "booktitle": "The 25th Annual International Conference on Mobile Computing and Networking", "numpages": "15", "keywords": ["x86 windows pc", "mobile gaming", "android emulation"], "location": "Los Cabos, Mexico", "series": "MobiCom '19"}