{"authors": [{"first": "Aidan", "last": "Curtis"}, {"first": "Amruta", "last": "Pai"}, {"first": "Jian", "last": "Cao"}, {"first": "Nidal", "last": "Moukaddam"}, {"first": "Ashutosh", "last": "Sabharwal"}], "title": "HealthSense: Software-Defined Mobile-Based Clinical Trials", "year": "2019", "isbn": "9781450361699", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3300061.3345433", "doi": "10.1145/3300061.3345433", "abstract": "With the rise of ever-more sophisticated wearables and sensing technologies, mobile health continues to be an active area of research. However, from a clinical researcher point of view, testing novel use of the mobile health innovations remains a major hurdle, as composing a clinical trial using a combination of technologies still remains in the realm of computer scientists. We take a software-inspired viewpoint of clinical trial designs to design, develop and validate HealthSense to enable expressibility of complex ideas, composability with diverse devices and services while maximally maintaining simplicity for a clinical research user. A key innovation in HealthSense is the concept of a study state manager (SSM) that modifies parameters of the study over time as data accumulates and can trigger external events that affect the participant; this design allows us to implement nearly arbitrary clinical trial designs. The SSM can funnel data streams to custom or third-party cloud processing pipelines and the result can be used to give interventions and modify parameters of the study. HealthSense supports both Android and iOS platforms and is secure, scalable and fully operational. We outline three trials (two with clinical populations) to highlight simplicity, composability, and expressibility of HealthSense.", "booktitle": "The 25th Annual International Conference on Mobile Computing and Networking", "numpages": "15", "keywords": ["clinical trials", "mobile systems", "digital interventions", "software-defined"], "location": "Los Cabos, Mexico", "series": "MobiCom '19"}