{"authors": [{"first": "Ghufran", "last": "Baig"}, {"first": "Jian", "last": "He"}, {"first": "Mubashir Adnan", "last": "Qureshi"}, {"first": "Lili", "last": "Qiu"}, {"first": "Guohai", "last": "Chen"}, {"first": "Peng", "last": "Chen"}, {"first": "Yinliang", "last": "Hu"}], "title": "Jigsaw: Robust Live 4K Video Streaming", "year": "2019", "isbn": "9781450361699", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3300061.3300127", "doi": "10.1145/3300061.3300127", "abstract": "The popularity of 4K videos has grown significantly in the past few years. Yet coding and streaming live 4K videos incurs prohibitive cost to the network and end system. Motivated by this observation, we explore the feasibility of supporting live 4K video streaming over wireless networks using commodity devices. Given the high data rate requirement of 4K videos, 60 GHz is appealing, but its large and unpredictable throughput fluctuation makes it hard to provide desirable user experience. In particular, to support live 4K video streaming, we should (i) adapt to highly variable and unpredictable wireless throughput, (ii) support efficient 4K video coding on commodity devices. To this end, we propose a novel system, Jigsaw. It consists of (i) easy-to-compute layered video coding to seamlessly adapt to unpredictable wireless link fluctuations, (ii) efficient GPU implementation of video coding on commodity devices, and (iii) effectively leveraging both WiFi and WiGig through delayed video adaptation and smart scheduling. Using real experiments and emulation, we demonstrate the feasibility and effectiveness of our system. Our results show that it improves PSNR by 6-15dB and improves SSIM by 0.011-0.217 over state-of-the-art approaches. Moreover, even when throughput fluctuates widely between 0.2Gbps-2Gbps, it can achieve an average PSNR of 33dB.", "booktitle": "The 25th Annual International Conference on Mobile Computing and Networking", "numpages": "16", "keywords": ["60 ghz", "4k video", "live streaming", "layered coding"], "location": "Los Cabos, Mexico", "series": "MobiCom '19"}