{"authors": [{"first": "Br", "last": "Ghena"}, {"first": "Joshua", "last": "Adkins"}, {"first": "Longfei", "last": "Shangguan"}, {"first": "Kyle", "last": "Jamieson"}, {"first": "Philip", "last": "Levis"}, {"first": "Prabal", "last": "Dutta"}], "title": "Challenge: Unlicensed LPWANs Are Not Yet the Path to Ubiquitous Connectivity", "year": "2019", "isbn": "9781450361699", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3300061.3345444", "doi": "10.1145/3300061.3345444", "abstract": "Low-power wide-area networks (LPWANs) are a compelling answer to the networking challenges faced by many Internet of Things devices. Their combination of low power, long range, and deployment ease has motivated a flurry of research, including exciting results on backscatter and interference cancellation that further lower power budgets and increase capacity. But despite the interest, we argue that unlicensed LPWAN technologies can only serve a narrow class of Internet of Things applications due to two principal challenges: capacity and coexistence. We propose a metric, bit flux, to describe networks and applications in terms of throughput over a coverage area. Using bit flux, we find that the combination of low bit rate and long range restricts the use case of LPWANs to sparse sensing applications. Furthermore, this lack of capacity leads networks to use as much available bandwidth as possible, and a lack of coexistence mechanisms causes poor performance in the presence of multiple, independently-administered networks. We discuss a variety of techniques and approaches that could be used to address these two challenges and enable LPWANs to achieve the promise of ubiquitous connectivity.", "booktitle": "The 25th Annual International Conference on Mobile Computing and Networking", "numpages": "12", "keywords": ["lorawan", "nb-iot", "lte-m", "low-power wide-area networks"], "location": "Los Cabos, Mexico", "series": "MobiCom '19"}