{"authors": [{"first": "Soowon", "last": "Kang"}, {"first": "Hyeonwoo", "last": "Choi"}, {"first": "Sooyoung", "last": "Park"}, {"first": "Chunjong", "last": "Park"}, {"first": "Jemin", "last": "Lee"}, {"first": "Uichin", "last": "Lee"}, {"first": "Sung-Ju", "last": "Lee"}], "title": "Fire in Your Hands: Understanding Thermal Behavior of Smartphones", "year": "2019", "isbn": "9781450361699", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3300061.3300128", "doi": "10.1145/3300061.3300128", "abstract": "Overheating smartphones could hamper user experiences. While there have been numerous reports on smartphone overheating, a systematic measurement and user experience study on the thermal aspect of smartphones is missing. Using thermal imaging cameras, we measure and analyze the temperatures of various smartphones running diverse application workloads such as voice calling, video recording, video chatting, and 3D online gaming. Our experiments show that running popular applications such as video chat, could raise the smartphone's surface temperature to over 50$^circ$C in only 10 minutes, which could easily cause thermal pain to users. Recent ubiquitous scenarios such as augmented reality and mobile deep learning also have considerable thermal issues. We then perform a user study to examine when the users perceive heat discomfort from the smartphones and how they react to overheating. Most of our user study participants reported considerable thermal discomfort while playing a mobile game, and that overheating disrupted interaction flows. With this in mind, we devise a smartphone surface temperature prediction model, by using only system statistics and internal sensor values. Our evaluation showed high prediction accuracy with root-mean-square errors of less than 2$^circ$C. We discuss several insights from our findings and recommendations for user experience, OS design, and developer support for better user-thermal interactions.", "booktitle": "The 25th Annual International Conference on Mobile Computing and Networking", "numpages": "16", "keywords": ["thermal imaging camera", "smartphones", "user guidance", "thermal modeling", "thermal characteristics"], "location": "Los Cabos, Mexico", "series": "MobiCom '19"}