{"authors": [{"first": "Lillian", "last": "Tsai"}, {"first": "Roberta", "last": "De Viti"}, {"first": "Matthew", "last": "Lentz"}, {"first": "Stefan", "last": "Saroiu"}, {"first": "Bobby", "last": "Bhattacharjee"}, {"first": "Peter", "last": "Druschel"}], "title": "EnClosure: Group Communication via Encounter Closures (Poster)", "year": "2019", "isbn": "9781450366618", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3307334.3328614", "doi": "10.1145/3307334.3328614", "abstract": "New applications enabled by personal smart devices and the Internet-of-Things (IoT) require communication in the context of an encounter (a period of spatial co-location). However, existing encounter-based communication (EbC) systems are limited to communication among participants that share a direct encounter. This work is inspired by two insights: (1) encounters also enable group communication among devices connected by paths in the encounter graph that is contextual, spontaneous, secure, and privacy-preserving; and (2) addressing communication partners using encounter closures subject to causal, spatial, and temporal constraints enables powerful new forms of group communication. We present the design of enClosure, a service providing group communication based on encounter closures for mobile and IoT applications, and a prototype implementation for Android and the Microsoft Embedded Social Cloud platform. Using real-world traces, we show that enClosure provides a privacy-preserving, secure platform for a wide range of group communication applications ranging from connecting attendees of a large event to disseminating health risk warnings and tracing missing persons.", "booktitle": "Proceedings of the 17th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "2", "keywords": ["group communication", "internet-of-things (IoT)", "mobile computing", "privacy", "encounter-based communication"], "location": "Seoul, Republic of Korea", "series": "MobiSys '19"}