{"authors": [{"first": "Roshan", "last": "Ayyalasomayajula"}, {"first": "Aditya", "last": "Arun"}, {"first": "Chenfeng", "last": "Wu"}, {"first": "Sanatan", "last": "Sharma"}, {"first": "Abhishek Rajkumar", "last": "Sethi"}, {"first": "Deepak", "last": "Vasisht"}, {"first": "Dinesh", "last": "Bharadia"}], "title": "Deep Learning Based Wireless Localization for Indoor Navigation", "year": "2020", "isbn": "9781450370851", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3372224.3380894", "abstract": "Location services, fundamentally, rely on two components: a mapping system and a positioning system. The mapping system provides the physical map of the space, and the positioning system identifies the position within the map. Outdoor location services have thrived over the last couple of decades because of well-established platforms for both these components (e.g. Google Maps for mapping, and GPS for positioning). In contrast, indoor location services haven't caught up because of the lack of reliable mapping and positioning frameworks. Wi-Fi positioning lacks maps and is also prone to environmental errors. In this paper, we present DLoc, a Deep Learning based wireless localization algorithm that can overcome traditional limitations of RF-based localization approaches (like multipath, occlusions, etc.). We augment DLoc with an automated mapping platform, MapFind. MapFind constructs location-tagged maps of the environment and generates training data for DLoc. Together, they allow off-the-shelf Wi-Fi devices like smartphones to access a map of the environment and to estimate their position with respect to that map. During our evaluation, MapFind has collected location estimates of over 105 thousand points under 8 different scenarios with varying furniture positions and people motion across two different spaces covering 2000 sq. Ft. DLoc outperforms state-of-the-art methods in Wi-Fi-based localization by 80% (median &amp; 90th percentile) across the two different spaces.", "booktitle": "Proceedings of the 26th Annual International Conference on Mobile Computing and Networking", "numpages": "14"}