{"authors": [{"first": "Dipankar", "last": "Raychaudhuri"}, {"first": "Ivan", "last": "Seskar"}, {"first": "Gil", "last": "Zussman"}, {"first": "Thanasis", "last": "Korakis"}, {"first": "Dan", "last": "Kilper"}, {"first": "Tingjun", "last": "Chen"}, {"first": "Jakub", "last": "Kolodziejski"}, {"first": "Michael", "last": "Sherman"}, {"first": "Zoran", "last": "Kostic"}, {"first": "Xiaoxiong", "last": "Gu"}, {"first": "Harish", "last": "Krishnaswamy"}, {"first": "Sumit", "last": "Maheshwari"}, {"first": "Panagiotis", "last": "Skrimponis"}, {"first": "Craig", "last": "Gutterman"}], "title": "Challenge: COSMOS: A City-Scale Programmable Testbed for Experimentation with Advanced Wireless", "year": "2020", "isbn": "9781450370851", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3372224.3380891", "abstract": "This paper focuses on COSMOS - <u>C</u>loud enhanced <u>O</u>pen <u>S</u>oftware defined <u>MO</u>bile wireless testbed for city-<u>S</u>cale deployment. The COSMOS testbed is being deployed in West Harlem (New York City) as part of the NSF Platforms for Advanced Wireless Research (PAWR) program. It will enable researchers to explore the technology \"sweet spot\" of ultra-high bandwidth and ultra-low latency in the most demanding real-world environment. We describe the testbed's architecture, the design and deployment challenges, and the experience gained during the design and pilot deployment. Specifically, we describe COSMOS' computing and network architectures, the critical building blocks, and its programmability at different layers. The building blocks include software-defined radios, 28 GHz millimeter-wave phased array modules, optical transport network, core and edge cloud, and control and management software. We describe COSMOS' deployment phases in a dense urban environment, the research areas that could be studied in the testbed, and specific example experiments. Finally, we discuss our experience with using COSMOS as an educational tool.", "booktitle": "Proceedings of the 26th Annual International Conference on Mobile Computing and Networking", "numpages": "13"}