{"authors": [{"first": "Artur", "last": "Balanuta"}, {"first": "Nuno", "last": "Pereira"}, {"first": "Swarun", "last": "Kumar"}, {"first": "Anthony", "last": "Rowe"}], "title": "A Cloud-Optimized Link Layer for Low-Power Wide-Area Networks", "year": "2020", "isbn": "9781450379540", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3386901.3388915", "doi": "10.1145/3386901.3388915", "abstract": "Conventional wireless communication systems are typically designed assuming a single transmitter-receiver pair for each link. In Low-Power Wide-Area Networks (LP-WANs), this one-to-one design paradigm is often overly pessimistic in terms of link budget because client packets are frequently detected by multiple gateways (i.e. one-to-many). Prior work has shown massive improvement in performance when specialized hardware is used to coherently combine signals at the physical layer.In this paper, we explore the potential of using multiple receivers at the MAC and link layer where these performance gains are often neglected. We present an approach called Opportunistic Packet Recovery (OPR) that targets the most likely corrupt bits across a set of packets that suffered failed CRCs at multiple LoRa LP-WAN base-stations. We see that bit errors are often disjoint across receivers, which aids in collaborative error detection. OPR leverages this to provide increasing gain in error recovery as a function of the number of receiving gateways. Since LP-WAN networks can easily offload packet processing to the cloud, there is ample compute time per packet (order of seconds) to search for bit permutations that would restore packet integrity. Link layer corrections have the advantage of being immediately applicable to the millions of already deployed LP-WAN systems without additional hardware or expensive RF front-ends. We experimentally demonstrate that OPR can correct up to 72% of packets that would normally have failed, when they are captured by multiple gateways.", "booktitle": "Proceedings of the 18th International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["cloud computing", "interference mitigation", "co-existence", "low-power wide-area network (LPWAN)"], "location": "Toronto, Ontario, Canada", "series": "MobiSys '20"}