{"authors": [{"first": "Aditya Singh", "last": "Rathore"}, {"first": "Weijin", "last": "Zhu"}, {"first": "Afee", "last": "Daiyan"}, {"first": "Chenhan", "last": "Xu"}, {"first": "Kun", "last": "Wang"}, {"first": "Feng", "last": "Lin"}, {"first": "Kui", "last": "Ren"}, {"first": "Wenyao", "last": "Xu"}], "title": "SonicPrint: A Generally Adoptable and Secure Fingerprint Biometrics in Smart Devices", "year": "2020", "isbn": "9781450379540", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3386901.3388939", "doi": "10.1145/3386901.3388939", "abstract": "The advent of smart devices has caused unprecedented security and privacy concerns to its users. Although the fingerprint technology is a go-to biometric solution in high-impact applications (e.g., smart-phone security, monetary transactions and international-border verification), the existing fingerprint scanners are vulnerable to spoofing attacks via fake-finger and cannot be employed across smart devices (e.g., wearables) due to hardware constraints. We propose SonicPrint that extends fingerprint identification beyond smartphones to any smart device without the need for traditional fingerprint scanners. SonicPrint builds on the fingerprint-induced sonic effect (FiSe) caused by a user swiping his fingertip on smart devices and the resulting property, i.e., different users' fingerprint would result in distinct FiSe. As the first exploratory study, extensive experiments verify the above property with 31 participants over four different swipe actions on five different types of smart devices with even partial fingerprints. SonicPrint achieves up to a 98% identification accuracy on smartphone and an equal-error-rate (EER) less than 3% for smartwatch and headphones. We also examine and demonstrate the resilience of SonicPrint against fingerprint phantoms and replay attacks. A key advantage of SonicPrint is that it leverages the already existing microphones in smart devices, requiring no hardware modifications. Compared with other biometrics including physiological patterns and passive sensing, SonicPrint is a low-cost, privacy-oriented and secure approach to identify users across smart devices of unique form-factors.", "booktitle": "Proceedings of the 18th International Conference on Mobile Systems, Applications, and Services", "numpages": "14", "location": "Toronto, Ontario, Canada", "series": "MobiSys '20"}