{"authors": [{"first": "Shuai", "last": "Tong"}, {"first": "Jiliang", "last": "Wang"}, {"first": "Yunhao", "last": "Liu"}], "title": "Combating Packet Collisions Using Non-Stationary Signal Scaling in LPWANs", "year": "2020", "isbn": "9781450379540", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3386901.3388913", "doi": "10.1145/3386901.3388913", "abstract": "LoRa, a representative Low-Power Wide Area Network (LPWAN) technology, has been shown as a promising platform to connect Internet of Things. Practical LoRa deployments, however, suffer from collisions, especially in dense networks and wide coverage areas expected by LoRa applications. Existing collision resolution approaches do not exploit the coding properties of LoRa and thus cannot work well for low SNR LoRa signals. We propose NScale to decompose concurrent transmissions by leveraging subtle inter-packet time offsets for low SNR LoRa collisions. NScale (1) translates subtle time offsets, which are vulnerable to noise, to robust frequency features, and (2) further amplifies the time offsets by non-stationary signal scaling, i.e., scaling the amplitude of a symbol differently at different positions. In practical implementation, we propose a noise resistant iterative symbol recovery method to combat symbol distortion in low SNR, and address frequency shifts incurred by CFO and packet time offsets in decoding. We theoretically show that NScale introduces &lt; 1.7 dB SNR loss compared with the original LoRa. We implement NScale on USRP N210 and evaluate its performance in both indoor and outdoor networks. NScale is implemented in software at the gateway and can work for COTS LoRa nodes without any modification. The evaluation results show that NScale improves the network throughput by 3.3x for low SNR collided signals compared with other state-of-the-art methods.", "booktitle": "Proceedings of the 18th International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["LPWAN", "internet of things", "collision resolution", "LoRa"], "location": "Toronto, Ontario, Canada", "series": "MobiSys '20"}