{"authors": [{"first": "Gautam", "last": "Kumar"}, {"first": "N", "last": "Dukkipati"}, {"first": "Keon", "last": "Jang"}, {"first": "Hassan M. G.", "last": "Wassel"}, {"first": "Xian", "last": "Wu"}, {"first": "Behnam", "last": "Montazeri"}, {"first": "Yaogong", "last": "Wang"}, {"first": "Kevin", "last": "Springborn"}, {"first": "Christopher", "last": "Alfeld"}, {"first": "Michael", "last": "Ryan"}, {"first": "David", "last": "Wetherall"}, {"first": "Amin", "last": "Vahdat"}], "title": "Swift: Delay is Simple and Effective for Congestion Control in the Datacenter", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3406591", "doi": "10.1145/3387514.3406591", "abstract": "We report on experiences with Swift congestion control in Google datacenters. Swift targets an end-to-end delay by using AIMD control, with pacing under extreme congestion. With accurate RTT measurement and care in reasoning about delay targets, we find this design is a foundation for excellent performance when network distances are well-known. Importantly, its simplicity helps us to meet operational challenges. Delay is easy to decompose into fabric and host components to separate concerns, and effortless to deploy and maintain as a congestion signal while the datacenter evolves. In large-scale testbed experiments, Swift delivers a tail latency of &lt;50μs for short RPCs, with near-zero packet drops, while sustaining ~100Gbps throughput per server. This is a tail of &lt;3x the minimal latency at a load close to 100%. In production use in many different clusters, Swift achieves consistently low tail completion times for short RPCs, while providing high throughput for long RPCs. It has loss rates that are at least 10x lower than a DCTCP protocol, and handles O(10k) incasts that sharply degrade with DCTCP.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "15", "keywords": ["Congestion Control", "Performance Isolation", "Datacenter Transport"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}