{"authors": [{"first": "Chongrong", "last": "Fang"}, {"first": "Haoyu", "last": "Liu"}, {"first": "Mao", "last": "Miao"}, {"first": "Jie", "last": "Ye"}, {"first": "Lei", "last": "Wang"}, {"first": "Wansheng", "last": "Zhang"}, {"first": "Daxiang", "last": "Kang"}, {"first": "Biao", "last": "Lyv"}, {"first": "Peng", "last": "Cheng"}, {"first": "Jiming", "last": "Chen"}], "title": "VTrace: Automatic Diagnostic System for Persistent Packet Loss in Cloud-Scale Overlay Network", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405851", "doi": "10.1145/3387514.3405851", "abstract": "Persistent packet loss in the cloud-scale overlay network severely compromises tenant experiences. Cloud providers are keen to automatically and quickly determine the root cause of such problems. However, existing work is either designed for the physical network or insufficient to present the concrete reason of packet loss. In this paper, we propose to record and analyze the on-site forwarding condition of packets during packet-level tracing. The cloud-scale overlay network presents great challenges to achieve this goal with its high network complexity, multi-tenant nature, and diversity of root causes. To address these challenges, we present VTrace, an automatic diagnostic system for persistent packet loss over the cloud-scale overlay network. Utilizing the \"fast path-slow path\" structure of virtual forwarding devices (VFDs), e.g., vSwitches, VTrace installs several \"coloring, matching and logging\" rules in VFDs to selectively track the packets of interest and inspect them in depth. The detailed forwarding situation at each hop is logged and then assembled to perform analysis with an efficient path reconstruction scheme. Experiments are conducted to demonstrate VTrace's low overhead and quick responsiveness. We share experiences of how VTrace efficiently resolves persistent packet loss issues after deploying it in Alibaba Cloud for over 20 months.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "13", "keywords": ["Cloud-scale overlay network", "Network diagnosis"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}