{"authors": [{"first": "Ahmed", "last": "Saeed"}, {"first": "Varun", "last": "Gupta"}, {"first": "Prateesh", "last": "Goyal"}, {"first": "Milad", "last": "Sharif"}, {"first": "Rong", "last": "Pan"}, {"first": "Mostafa", "last": "Ammar"}, {"first": "Ellen", "last": "Zegura"}, {"first": "Keon", "last": "Jang"}, {"first": "Mohammad", "last": "Alizadeh"}, {"first": "Abdul", "last": "Kabbani"}, {"first": "Amin", "last": "Vahdat"}], "title": "Annulus: A Dual Congestion Control Loop for Datacenter and WAN Traffic Aggregates", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405899", "doi": "10.1145/3387514.3405899", "abstract": "Cloud services are deployed in datacenters connected though high-bandwidth Wide Area Networks (WANs). We find that WAN traffic negatively impacts the performance of datacenter traffic, increasing tail latency by 2.5x, despite its small bandwidth demand. This behavior is caused by the long round-trip time (RTT) for WAN traffic, combined with limited buffering in datacenter switches. The long WAN RTT forces datacenter traffic to take the full burden of reacting to congestion. Furthermore, datacenter traffic changes on a faster time-scale than the WAN RTT, making it difficult for WAN congestion control to estimate available bandwidth accurately.We present Annulus, a congestion control scheme that relies on two control loops to address these challenges. One control loop leverages existing congestion control algorithms for bottlenecks where there is only one type of traffic (i.e., WAN or datacenter). The other loop handles bottlenecks shared between WAN and datacenter traffic near the traffic source, using direct feedback from the bottleneck. We implement Annulus on a testbed and in simulation. Compared to baselines using BBR for WAN congestion control and DCTCP or DCQCN for datacenter congestion control, Annulus increases bottleneck utilization by 10% and lowers datacenter flow completion time by 1.3-3.5x.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "15", "keywords": ["Explicit Direct Congestion Notification", "Data Center Networks", "Congestion Control", "Wide-Area Networks"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}