{"authors": [{"first": "Vojislav", "last": "Dukic"}, {"first": "Ginni", "last": "Khanna"}, {"first": "Christos", "last": "Gkantsidis"}, {"first": "Thomas", "last": "Karagiannis"}, {"first": "Francesca", "last": "Parmigiani"}, {"first": "Ankit", "last": "Singla"}, {"first": "Mark", "last": "Filer"}, {"first": "Jeffrey L.", "last": "Cox"}, {"first": "Anna", "last": "Ptasznik"}, {"first": "Nick", "last": ""}, {"first": "Winston", "last": "Saunders"}, {"first": "Christian", "last": "Belady"}], "title": "Beyond the Mega-Data Center: Networking Multi-Data Center Regions", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3406220", "doi": "10.1145/3387514.3406220", "abstract": "The difficulty of building large data centers in dense metro areas is pushing big cloud providers towards a different approach to scaling: multiple smaller data centers within tens of kilometers of each other, comprising a \"region\". We show that networking this small number of nearby sites with each other is a surprisingly challenging and multi-faceted problem. We draw out the operational goals and constraints of such networks, and highlight the design trade-offs involved using data from Microsoft Azure's regions.Our analysis of the design space shows that network topologies that achieve lower latency and allow greater flexibility in data center placement are, unfortunately, encumbered by their much greater cost and complexity. We thus present and demonstrate a novel optical-circuit-switched architecture, Iris, that lowers these cost and complexity barriers, making a richer topology design space more accessible to operators of regional networks. With Iris, topologies which, in comparison to a simple hub-and-spoke topology can increase the area in which a new DC can be placed by 2-5x, can be implemented at a cost within 1.1x of the simple hub-and-spoke topology, and 7x cheaper than a natural packet-switched network.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "17", "keywords": ["optical networks", "DCI", "region", "optical switching", "cloud", "data center interconnect"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}