{"authors": [{"first": "Yue", "last": "Wu"}, {"first": "Purui", "last": "Wang"}, {"first": "Kenuo", "last": "Xu"}, {"first": "Lilei", "last": "Feng"}, {"first": "Chenren", "last": "Xu"}], "title": "Turboboosting Visible Light Backscatter Communication", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3406229", "doi": "10.1145/3387514.3406229", "abstract": "Visible light backscatter communication (VLBC) presents an emerging low power IoT connectivity solution with spatial reuse and interference immunity advantages over RF-based (backscatter) technologies. State-of-the-art VLBC systems employ COTS LCD shutter as optical modulator, whose slow response fundamentally throttles its data rate to sub-Kbps, and limits its deployment at scale for use cases where higher rate and/or low latency is a necessity.We design and implement RetroTurbo, a VLBC system dedicated for turboboosting data rate. At the heart of RetroTurbo design is a pair of novel modulation schemes, namely delayed superimposition modulation (DSM) and polarization-based QAM (PQAM), to push the rate limit by strategically coordinating the state of a liquid crystal modulator (LCM) pixel array in time and polarization domains. Specifically, DSM ensures we fully exploit the available SNR for high order modulation in the LCM-imposed nonlinear channel; PQAM is based on polarized light communication that creates a QAM design in polarization domain with flexible angular misalignment between two ends. A real-time near-optimal demodulation algorithm is designed to ensure system's robustness to heterogeneous signal distortion. Based on our prototyped system, RetroTurbo demonstrates 32x and 128x rate gain via experiments and emulation respectively in practical real-world indoor setting.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "12", "keywords": ["Delayed Superimposed Modulation", "Visible Light Backscatter Communication", "Polarization-based QAM"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}