{"authors": [{"first": "Zhiqiang", "last": "He"}, {"first": "Dongyang", "last": "Wang"}, {"first": "Binzhang", "last": "Fu"}, {"first": "Kun", "last": "Tan"}, {"first": "Bei", "last": "Hua"}, {"first": "Zhi-Li", "last": "Zhang"}, {"first": "Kai", "last": "Zheng"}], "title": "MasQ: RDMA for Virtual Private Cloud", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405849", "doi": "10.1145/3387514.3405849", "abstract": "RDMA communication in virtual private cloud (VPC) networks is still a challenging job due to the difficulty in fulfilling all virtualization requirements without sacrificing RDMA communication performance. To address this problem, this paper proposes a software-defined solution, namely, MasQ, which is short for \"queue masquerade\". The core insight of MasQ is that all RDMA communications should associate with at least one queue pair (QP). Thus, the requirements of virtualization, such as network isolation and the application of security rules, can be easily fulfilled if QP's behavior is properly defined. In particular, MasQ exploits the virtio-based paravirtualization technique to realize the control path. Moreover, to avoid performance overhead, MasQ leaves all data path operations, such as sending and receiving, to the hardware. We have implemented MasQ in the OpenFabrics Enterprise Distribution (OFED) framework and proved its scalability and performance efficiency by evaluating it against typical applications. The results demonstrate that MasQ achieves almost the same performance as bare-metal RDMA for data communication.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "14", "keywords": ["Datacenter network", "Network virtualization", "RDMA"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}