{"authors": [{"first": "Fangdan", "last": "Ye"}, {"first": "Da", "last": "Yu"}, {"first": "Ennan", "last": "Zhai"}, {"first": "Hongqiang Harry", "last": "Liu"}, {"first": "Bingchuan", "last": "Tian"}, {"first": "Qiaobo", "last": "Ye"}, {"first": "Chunsheng", "last": "Wang"}, {"first": "Xin", "last": "Wu"}, {"first": "Tianchen", "last": "Guo"}, {"first": "Cheng", "last": "Jin"}, {"first": "Duncheng", "last": "She"}, {"first": "Qing", "last": "Ma"}, {"first": "Biao", "last": "Cheng"}, {"first": "Hui", "last": "Xu"}, {"first": "Ming", "last": "Zhang"}, {"first": "Zhiliang", "last": "Wang"}, {"first": "Rodrigo", "last": "Fonseca"}], "title": "Accuracy, Scalability, Coverage: A Practical Configuration Verifier on a Global WAN", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3406217", "doi": "10.1145/3387514.3406217", "abstract": "This paper presents Hoyan-- the first reported large scale deployment of configuration verification in a global-scale wide area network (WAN). Hoyan has been running in production for more than two years and is currently used for all critical configuration auditing and updates on the WAN. We highlight our innovative designs and real-life experience to make Hoyan accurate and scalable in practice. For accuracy under the inconsistencies of devices' vendor-specific behaviors (VSBs), Hoyan continuously discovers the flaws in device behavior models, thus aiding the operators in fixing the models. For scalability to verify our global WAN, Hoyan introduces a \"global-simulation &amp; local formal-modeling\" strategy to model uncertainties in small scales and perform aggressive pruning of possibilities during the protocol simulations. Hoyan achieves near-100% verification accuracy after it detected and fixed O(10) VSBs on our WAN. Hoyan has prevented many potential service failures resulting from misconfiguration and reduced the failure rate of updates of our WAN by more than half in 2019.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "16", "keywords": ["Network Verification", "Reliability", "Network Configurations"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}