{"authors": [{"first": "Dongzhu", "last": "Xu"}, {"first": "Anfu", "last": "Zhou"}, {"first": "Xinyu", "last": "Zhang"}, {"first": "Guixian", "last": "Wang"}, {"first": "Xi", "last": "Liu"}, {"first": "Congkai", "last": "An"}, {"first": "Yiming", "last": "Shi"}, {"first": "Liang", "last": "Liu"}, {"first": "Huadong", "last": "Ma"}], "title": "Understanding Operational 5G: A First Measurement Study on Its Coverage, Performance and Energy Consumption", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405882", "doi": "10.1145/3387514.3405882", "abstract": "5G, as a monumental shift in cellular communication technology, holds tremendous potential for spurring innovations across many vertical industries, with its promised multi-Gbps speed, sub-10 ms low latency, and massive connectivity. On the other hand, as 5G has been deployed for only a few months, it is unclear how well and whether 5G can eventually meet its prospects. In this paper, we demystify operational 5G networks through a first-of-its-kind cross-layer measurement study. Our measurement focuses on four major perspectives: (i) Physical layer signal quality, coverage and hand-off performance; (ii) End-to-end throughput and latency; (iii) Quality of experience of 5G's niche applications (e.g., 4K/5.7K panoramic video telephony); (iv) Energy consumption on smartphones. The results reveal that the 5G link itself can approach Gbps throughput, but legacy TCP leads to surprisingly low capacity utilization (&lt; 32%), latency remains too high to support tactile applications and power consumption escalates to 2 - 3x over 4G. Our analysis suggests that the wireline paths, upper-layer protocols, computing and radio hardware architecture need to co-evolve with 5G to form an ecosystem, in order to fully unleash its potential.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "16", "keywords": ["Network Measurement", "End-to-end Performance", "TCP", "Energy Efficiency", "5G", "Network Coverage"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}