{"authors": [{"first": "Yotam", "last": "Harchol"}, {"first": "Dirk", "last": "Bergemann"}, {"first": "Nick", "last": "Feamster"}, {"first": "Eric", "last": "Friedman"}, {"first": "Arvind", "last": "Krishnamurthy"}, {"first": "Aurojit", "last": "a"}, {"first": "Sylvia", "last": "Ratnasamy"}, {"first": "Michael", "last": "Schapira"}, {"first": "Scott", "last": "Shenker"}], "title": "A Public Option for the Core", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405875", "doi": "10.1145/3387514.3405875", "abstract": "This paper is focused not on the Internet architecture - as defined by layering, the narrow waist of IP, and other core design principles - but on the Internet infrastructure, as embodied in the technologies and organizations that provide Internet service. In this paper we discuss both the challenges and the opportunities that make this an auspicious time to revisit how we might best structure the Internet's infrastructure. Currently, the tasks of transit-between-domains and last-mile-delivery are jointly handled by a set of ISPs who interconnect through BGP. In this paper we propose cleanly separating these two tasks. For transit, we propose the creation of a \"public option\" for the Internet's core backbone. This public option core, which complements rather than replaces the backbones used by large-scale ISPs, would (i) run an open market for backbone bandwidth so it could leverage links offered by third-parties, and (ii) structure its terms-of-service to enforce network neutrality so as to encourage competition and reduce the advantage of large incumbents.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "13", "keywords": ["Internet transit", "Internet infrastructure", "Network neutrality"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}