{"authors": [{"first": "Tong", "last": "Li"}, {"first": "Kai", "last": "Zheng"}, {"first": "Ke", "last": "Xu"}, {"first": "Rahul Arvind", "last": "Jadhav"}, {"first": "Tao", "last": "Xiong"}, {"first": "Keith", "last": "Winstein"}, {"first": "Kun", "last": "Tan"}], "title": "TACK: Improving Wireless Transport Performance by Taming Acknowledgments", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405850", "doi": "10.1145/3387514.3405850", "abstract": "The shared nature of the wireless medium induces contention between data transport and backward signaling, such as acknowledgement. The current way of TCP acknowledgment induces control overhead which is counter-productive for TCP performance especially in wireless local area network (WLAN) scenarios.In this paper, we present a new acknowledgement called TACK (\"Tame ACK\"), as well as its TCP implementation TCP-TACK. TCP-TACK works on top of commodity WLAN, delivering high wireless transport goodput with minimal control overhead in the form of ACKs, without any hardware modification. To minimize ACK frequency, TACK abandons the legacy received-packet-driven ACK. Instead, it balances byte-counting ACK and periodic ACK so as to achieve a controlled ACK frequency. Evaluation results show that TCP-TACK achieves significant advantages over legacy TCP in WLAN scenarios due to less contention between data packets and ACKs. Specifically, TCP-TACK reduces over 90% of ACKs and also obtains an improvement of ~ 28% on good-put. We further find it performs equally well as high-speed TCP variants in wide area network (WAN) scenarios, this is attributed to the advancements of the TACK-based protocol design in loss recovery, round-trip timing, and send rate control.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "16", "keywords": ["ACK frequency", "instant ACK", "periodic ACK", "acknowledgement mechanism"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}