{"authors": [{"first": "Xiaoqi", "last": "Chen"}, {"first": "Shir", "last": "au-Feibish"}, {"first": "Mark", "last": "Braverman"}, {"first": "Jennifer", "last": "Rexford"}], "title": "BeauCoup: Answering Many Network Traffic Queries, One Memory Update at a Time", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405865", "doi": "10.1145/3387514.3405865", "abstract": "Network administrators constantly monitor network traffic for congestion and attacks. They need to perform a large number of measurements on the traffic simultaneously, to detect different types of anomalies such as heavy hitters or super-spreaders. Existing techniques often focus on a single statistic (e.g., traffic volume) or traffic attribute (e.g., destination IP). However, performing numerous heterogeneous measurements within the constrained memory architecture of modern network devices poses significant challenges, due to the limited number of memory accesses allowed per packet. We propose BeauCoup, a system based on the coupon collector problem, that supports multiple distinct counting queries simultaneously while making only a small constant number of memory accesses per packet. We implement BeauCoup on PISA commodity programmable switches, satisfying the strict memory size and access constraints while using a moderate portion of other data-plane hardware resources. Evaluations show BeauCoup achieves the same accuracy as other sketch-based or sampling-based solutions using 4x fewer memory access.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "14", "keywords": ["Data Plane", "Network Measurement", "Streaming Algorithm", "Distinct Counting", "Programmable Switch", "Sketching"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}