{"authors": [{"first": "Arjun", "last": "Singhvi"}, {"first": "Aditya", "last": "Akella"}, {"first": "Dan", "last": "Gibson"}, {"first": "Thomas F.", "last": "Wenisch"}, {"first": "Monica", "last": "Wong-Chan"}, {"first": "Sean", "last": "Clark"}, {"first": "Milo M. K.", "last": "Martin"}, {"first": "Moray", "last": "McLaren"}, {"first": "Prashant", "last": "ra"}, {"first": "Rob", "last": "Cauble"}, {"first": "Hassan M. G.", "last": "Wassel"}, {"first": "Behnam", "last": "Montazeri"}, {"first": "Simon L.", "last": "Sabato"}, {"first": "Joel", "last": "Scherpelz"}, {"first": "Amin", "last": "Vahdat"}], "title": "1RMA: Re-Envisioning Remote Memory Access for Multi-Tenant Datacenters", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405897", "doi": "10.1145/3387514.3405897", "abstract": "Remote Direct Memory Access (RDMA) plays a key role in supporting performance-hungry datacenter applications. However, existing RDMA technologies are ill-suited to multi-tenant datacenters, where applications run at massive scales, tenants require isolation and security, and the workload mix changes over time. Our experiences seeking to operationalize RDMA at scale indicate that these ills are rooted in standard RDMA's basic design attributes: connectionorientedness and complex policies baked into hardware.We describe a new approach to remote memory access -- One-Shot RMA (1RMA) -- suited to the constraints imposed by our multi-tenant datacenter settings. The 1RMA NIC is connection-free and fixed-function; it treats each RMA operation independently, assisting software by offering fine-grained delay measurements and fast failure notifications. 1RMA software provides operation pacing, congestion control, failure recovery, and inter-operation ordering, when needed. The NIC, deployed in our production datacenters, supports encryption at line rate (100Gbps and 100M ops/sec) with minimal performance/availability disruption for encryption key rotation.", "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "14", "keywords": ["Remote Memory Access", "Connection Free", "Congestion Control"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}