{"authors": [{"first": "Sunjae", "last": "Lee"}, {"first": "Hayeon", "last": "Lee"}, {"first": "Hoyoung", "last": "Kim"}, {"first": "Sangmin", "last": "Lee"}, {"first": "Jeong Woon", "last": "Choi"}, {"first": "Yuseung", "last": "Lee"}, {"first": "Seono", "last": "Lee"}, {"first": "Ahyeon", "last": "Kim"}, {"first": "Jean Young", "last": "Song"}, {"first": "Sangeun", "last": "Oh"}, {"first": "Steven Y.", "last": "Ko"}, {"first": "Insik", "last": "Shin"}], "title": "FLUID-XP: Flexible User Interface Distribution for Cross-Platform Experience", "year": "2021", "isbn": "9781450383424", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3447993.3483245", "abstract": "Being able to use a single app across multiple devices can bring novel experiences to the users in various domains including entertainment and productivity. For instance, a user of a video editing app would be able to use a smart pad as a canvas and a smartphone as a remote toolbox so that the toolbox does not occlude the canvas during editing. However, existing approaches do not properly support the single-app multi-device execution due to several limitations, including high development cost, device heterogeneity, and high performance requirement. In this paper, we introduce FLUID-XP, a novel cross-platform multi-device system that enables UIs of a single app to be executed across heterogeneous platforms, while overcoming the limitations of previous approaches. FLUID-XP provides flexible, efficient, and seamless interactions by addressing three main challenges: i) how to transparently enable a single-display app to use multiple displays, ii) how to distribute UIs across heterogeneous devices with minimal network traffic, and iii) how to optimize the UI distribution process when multiple UIs have different distribution requirements. Our experiments with a working prototype of FLUID-XP on Android confirm that FLUID-XP successfully supports a variety of unmodified real-world apps across heterogeneous platforms (Android, iOS, and Linux). We also conduct a lab study with 25 participants to demonstrate the effectiveness of FLUID-XP with real users.", "booktitle": "Proceedings of the 27th Annual International Conference on Mobile Computing and Networking", "numpages": "13"}