{"authors": [{"first": "Marwan", "last": "Fayed"}, {"first": "Lorenz", "last": "Bauer"}, {"first": "Vasileios", "last": "Giotsas"}, {"first": "Sami", "last": "Kerola"}, {"first": "Marek", "last": "Majkowski"}, {"first": "Pavel", "last": "Odintsov"}, {"first": "Jakub", "last": "Sitnicki"}, {"first": "Taejoong", "last": "Chung"}, {"first": "Dave", "last": "Levin"}, {"first": "Alan", "last": "Mislove"}, {"first": "Christopher A.", "last": "Wood"}, {"first": "Nick", "last": "Sullivan"}], "title": "The Ties That Un-Bind: Decoupling IP from Web Services and Sockets for Robust Addressing Agility at CDN-Scale", "year": "2021", "isbn": "9781450383837", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3452296.3472922", "doi": "10.1145/3452296.3472922", "abstract": "The couplings between IP addresses, names of content or services, and socket interfaces, are too tight. This impedes system manageability, growth, and overall provisioning. In turn, large-scale content providers are forced to use staggering numbers of addresses, ultimately leading to address exhaustion (IPv4) and inefficiency (IPv6).In this paper, we revisit IP bindings, entirely. We attempt to evolve addressing conventions by decoupling IP in DNS and from network sockets. Alongside technologies such as SNI and ECMP, a new architecture emerges that ``unbinds'' IP from services and servers, thereby returning IP's role to merely that of reachability. The architecture is under evaluation at a major CDN in multiple datacenters. We show that addresses can be generated randomly emph{per-query}, for 20M+ domains and services, from as few as ~4K addresses, 256 addresses, and even emph{one} IP address. We explain why this approach is transparent to routing, L4/L7 load-balancers, distributed caching, and all surrounding systems -- and is emph{highly desirable}. Our experience suggests that many network-oriented systems and services (e.g., route leak mitigation, denial of service, measurement) could be improved, and new ones designed, if built with addressing agility.", "booktitle": "Proceedings of the 2021 ACM SIGCOMM 2021 Conference", "numpages": "14", "keywords": ["provisioning", "content distribution", "addressing", "programmable sockets"], "location": "Virtual Event, USA", "series": "SIGCOMM '21"}