{"authors": [{"first": "Yinda", "last": "Zhang"}, {"first": "Zaoxing", "last": "Liu"}, {"first": "Ruixin", "last": "Wang"}, {"first": "Tong", "last": "Yang"}, {"first": "Jizhou", "last": "Li"}, {"first": "Ruijie", "last": "Miao"}, {"first": "Peng", "last": "Liu"}, {"first": "Ruwen", "last": "Zhang"}, {"first": "Junchen", "last": "Jiang"}], "title": "CocoSketch: High-Performance Sketch-Based Measurement over Arbitrary Partial Key Query", "year": "2021", "isbn": "9781450383837", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3452296.3472892", "doi": "10.1145/3452296.3472892", "abstract": "Sketch-based measurement has emerged as a promising alternative to the traditional sampling-based network measurement approaches due to its high accuracy and resource efficiency. While there have been various designs around sketches, they focus on measuring one particular flow key, and it is infeasible to support many keys based on these sketches. In this work, we take a significant step towards supporting arbitrary partial key queries, where we only need to specify a full range of possible flow keys that are of interest before measurement starts, and in query time, we can extract the information of any key in that range. We design CocoSketch, which casts arbitrary partial key queries to the subset sum estimation problem and makes the theoretical tools for subset sum estimation practical. To realize desirable resource-accuracy tradeoffs in software and hardware platforms, we propose two techniques: (1) stochastic variance minimization to significantly reduce per-packet update delay, and (2) removing circular dependencies in the per-packet update logic to make the implementation hardware-friendly. We implement CocoSketch on four popular platforms (CPU, Open vSwitch, P4, and FPGA) and show that compared to baselines that use traditional single-key sketches, CocoSketch improves average packet processing throughput by 27.2x and accuracy by 10.4x when measuring six flow keys.", "booktitle": "Proceedings of the 2021 ACM SIGCOMM 2021 Conference", "numpages": "16", "keywords": ["P4", "FPGA", "sketch", "arbitrary partial key query"], "location": "Virtual Event, USA", "series": "SIGCOMM '21"}