{"authors": [{"first": "Yi", "last": "Ding"}, {"first": "Yu", "last": "Yang"}, {"first": "Wenchao", "last": "Jiang"}, {"first": "Yunhuai", "last": "Liu"}, {"first": "Tian", "last": "He"}, {"first": "Desheng", "last": "Zhang"}], "title": "Nationwide Deployment and Operation of a Virtual Arrival Detection System in the Wild", "year": "2021", "isbn": "9781450383837", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3452296.3472911", "doi": "10.1145/3452296.3472911", "abstract": "We report a 30-month nationwide deployment and operation study of an indoor arrival detection system based on Bluetooth Low Energy called VALID in 364 Chinese cities. VALID is pilot-studied, deployed, and operated in the wild to infer real-time indoor arrival status of couriers, and improve their status reporting behavior based on the detection. During its full nationwide operation (2018/12- 2021/01), VALID consists of virtual devices at 3 million shops and restaurants, where 530,859 of them are in multi-story malls and markets to infer and influence 1 million couriers' behavior, and assist the scheduling of 3.9 billion orders for 186 million customers. Although indoor arrival detection is straightforward in controlled environments, the scale of our platform makes the cost prohibitively high. In this work, we explore to use merchants' smartphones under their consent as a virtual infrastructure to design, build, deploy, and operate VALID from in-lab conception to nationwide operation in three phases for 30 months. We consider metrics including system evolution, reliability, utility, participation, energy, privacy, monetary benefits, along with couriers' behavior changes. We share three lessons and their implications for similar wireless sensing or communication systems with large geospatial operations.", "booktitle": "Proceedings of the 2021 ACM SIGCOMM 2021 Conference", "numpages": "13", "keywords": ["operational system", "nationwide deployment", "Bluetooth sensing", "arrival detection"], "location": "Virtual Event, USA", "series": "SIGCOMM '21"}