{"authors": [{"first": "Bingchuan", "last": "Tian"}, {"first": "Jiaqi", "last": "Gao"}, {"first": "Mengqi", "last": "Liu"}, {"first": "Ennan", "last": "Zhai"}, {"first": "Yanqing", "last": "Chen"}, {"first": "Yu", "last": "Zhou"}, {"first": "Li", "last": "Dai"}, {"first": "Feng", "last": "Yan"}, {"first": "Mengjing", "last": "Ma"}, {"first": "Ming", "last": "Tang"}, {"first": "Jie", "last": "Lu"}, {"first": "Xionglie", "last": "Wei"}, {"first": "Hongqiang Harry", "last": "Liu"}, {"first": "Ming", "last": "Zhang"}, {"first": "Chen", "last": "Tian"}, {"first": "Minlan", "last": "Yu"}], "title": "Aquila: A Practically Usable Verification System for Production-Scale Programmable Data Planes", "year": "2021", "isbn": "9781450383837", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3452296.3472937", "doi": "10.1145/3452296.3472937", "abstract": "This paper presents Aquila, the first practically usable verification system for Alibaba's production-scale programmable data planes. Aquila addresses four challenges in building a practically usable verification: (1) specification complexity; (2) verification scalability; (3) bug localization; and (4) verifier self validation. Specifically, first, Aquila proposes a high-level language that facilitates easy expression of specifications, reducing lines of specification codes by tenfold compared to the state-of-the-art. Second, Aquila constructs a sequential encoding algorithm to circumvent the exponential growth of states associated with the upscaling of data plane programs to production level. Third, Aquila adopts an automatic and accurate bug localization approach that can narrow down suspects based on reported violations and pinpoint the culprit by simulating a fix for each suspect. Fourth and finally, Aquila can perform self validation based on refinement proof, which involves the construction of an alternative representation and subsequent equivalence checking. To this date, Aquila has been used in the verification of our production-scale programmable edge networks for over half a year, and it has successfully prevented many potential failures resulting from data plane bugs.", "booktitle": "Proceedings of the 2021 ACM SIGCOMM 2021 Conference", "numpages": "16", "keywords": ["programmable switches", "formal methods", "P4 verification"], "location": "Virtual Event, USA", "series": "SIGCOMM '21"}