{"authors": [{"first": "Siyu", "last": "Yan"}, {"first": "Xiaoliang", "last": "Wang"}, {"first": "Xiaolong", "last": "Zheng"}, {"first": "Yinben", "last": "Xia"}, {"first": "Derui", "last": "Liu"}, {"first": "Weishan", "last": "Deng"}], "title": "ACC: Automatic ECN Tuning for High-Speed Datacenter Networks", "year": "2021", "isbn": "9781450383837", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3452296.3472927", "doi": "10.1145/3452296.3472927", "abstract": "For the widely deployed ECN-based congestion control schemes, the marking threshold is the key to deliver high bandwidth and low latency. However, due to traffic dynamics in the high-speed production networks, it is difficult to maintain persistent performance by using the static ECN setting. To meet the operational challenge, in this paper we report the design and implementation of an automatic run-time optimization scheme, ACC, which leverages the multi-agent reinforcement learning technique to dynamically adjust the marking threshold at each switch. The proposed approach works in a distributed fashion and combines offline and online training to adapt to dynamic traffic patterns. It can be easily deployed based on the common features supported by major commodity switching chips. Both testbed experiments and large-scale simulations have shown that ACC achieves low flow completion time (FCT) for both mice flows and elephant flows at line-rate. Under heterogeneous production environments with 300 machines, compared with the well-tuned static ECN settings, ACC achieves up to 20% improvement on IOPS and 30% lower FCT for storage service. ACC has been applied in high-speed datacenter networks and significantly simplifies the network operations.", "booktitle": "Proceedings of the 2021 ACM SIGCOMM 2021 Conference", "numpages": "14", "keywords": ["ECN", "congestion control", "datacenter network", "AQM"], "location": "Virtual Event, USA", "series": "SIGCOMM '21"}