{"authors": [{"first": "Petros", "last": "Gigis"}, {"first": "Matt", "last": "Calder"}, {"first": "Lefteris", "last": "Manassakis"}, {"first": "George", "last": "Nomikos"}, {"first": "Vasileios", "last": "Kotronis"}, {"first": "Xenofontas", "last": "Dimitropoulos"}, {"first": "Ethan", "last": "Katz-Bassett"}, {"first": "Georgios", "last": "Smaragdakis"}], "title": "Seven Years in the Life of Hypergiants' off-Nets", "year": "2021", "isbn": "9781450383837", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3452296.3472928", "doi": "10.1145/3452296.3472928", "abstract": "Content Hypergiants deliver the vast majority of Internet traffic to end users. In recent years, some have invested heavily in deploying services and servers inside end-user networks. With several dozen Hypergiants and thousands of servers deployed inside networks, these off-net (meaning outside the Hypergiant networks) deployments change the structure of the Internet. Previous efforts to study them have relied on proprietary data or specialized per-Hypergiant measurement techniques that neither scale nor generalize, providing a limited view of content delivery on today's Internet.In this paper, we develop a generic and easy to implement methodology to measure the expansion of Hypergiants' off-nets. Our key observation is that Hypergiants increasingly encrypt their traffic to protect their customers' privacy. Thus, we can analyze publicly available Internet-wide scans of port 443 and retrieve TLS certificates to discover which IP addresses host Hypergiant certificates in order to infer the networks hosting off-nets for the corresponding Hypergiants. Our results show that the number of networks hosting Hypergiant off-nets has tripled from 2013 to 2021, reaching 4.5k networks. The largest Hypergiants dominate these deployments, with almost all of these networks hosting an off-net for at least one -- and increasingly two or more -- of Google, Netflix, Facebook, or Akamai. These four Hypergiants have off-nets within networks that provide access to a significant fraction of end user population.", "booktitle": "Proceedings of the 2021 ACM SIGCOMM 2021 Conference", "numpages": "18", "keywords": ["content delivery networks", "server deployment", "Hypergiants", "TLS"], "location": "Virtual Event, USA", "series": "SIGCOMM '21"}