{"authors": [{"first": "Michael", "last": "Reininger"}, {"first": "Arushi", "last": "Arora"}, {"first": "Stephen", "last": "Herwig"}, {"first": "Nicholas", "last": "Francino"}, {"first": "Jayson", "last": "Hurst"}, {"first": "Christina", "last": "Garman"}, {"first": "Dave", "last": "Levin"}], "title": "Bento: Safely Bringing Network Function Virtualization to Tor", "year": "2021", "isbn": "9781450383837", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3452296.3472919", "doi": "10.1145/3452296.3472919", "abstract": "Tor is a powerful and important tool for providing anonymity and censorship resistance to users around the world. Yet it is surprisingly difficult to deploy new services in Tor—it is largely relegated to proxies and hidden services—or to nimbly react to new forms of attack. Conversely, “non-anonymous” Internet services are thriving like never before because of recent advances in programmable networks, such as Network Function Virtualization (NFV) which provides programmable in-network middleboxes.This paper seeks to close this gap by introducing programmable middleboxes into the Tor network. In this architecture, users can install and run sophisticated “functions” on willing Tor routers. We demonstrate a wide range of functions that improve anonymity, resilience to attack, performance of hidden services, and more. We present the design and implementation of an architecture, Bento, that protects middlebox nodes from the functions they run—and protects the functions from the middleboxes they run on.We evaluate Bento by running it on the live Tor network. We show that, with just a few lines of Python, we can significantly extend the capabilities of Tor to meet users' anonymity needs and nimbly react to new threats. We will be making our code and data publicly available.", "booktitle": "Proceedings of the 2021 ACM SIGCOMM 2021 Conference", "numpages": "15", "keywords": ["Tor", "network function virtualization (NFV)", "Intel SGX"], "location": "Virtual Event, USA", "series": "SIGCOMM '21"}