{"authors": [{"first": "Xiaomin", "last": "Ouyang"}, {"first": "Zhiyuan", "last": "Xie"}, {"first": "Jiayu", "last": "Zhou"}, {"first": "Jianwei", "last": "Huang"}, {"first": "Guoliang", "last": "Xing"}], "title": "ClusterFL: A Similarity-Aware Federated Learning System for Human Activity Recognition", "year": "2021", "isbn": "9781450384438", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3458864.3467681", "doi": "10.1145/3458864.3467681", "abstract": "Federated Learning (FL) has recently received significant interests thanks to its capability of protecting data privacy. However, existing FL paradigms yield unsatisfactory performance for a wide class of human activity recognition (HAR) applications since they are oblivious to the intrinsic relationship between data of different users. We propose ClusterFL, a similarity-aware federated learning system that can provide high model accuracy and low communication overhead for HAR applications. ClusterFL features a novel clustered multi-task federated learning framework that maximizes the training accuracy of multiple learned models while automatically capturing the intrinsic clustering relationship among the data of different nodes. Based on the learned cluster relationship, ClusterFL can efficiently drop out the nodes that converge slower or have little correlation with other nodes in each cluster, significantly speeding up the convergence while maintaining the accuracy performance. We evaluate the performance of ClusterFL on an NVIDIA edge testbed using four new HAR datasets collected from total 145 users. The results show that, ClusterFL outperforms several state-of-the-art FL paradigms in terms of overall accuracy, and save more than 50% communication overhead at the expense of negligible accuracy degradation.", "booktitle": "Proceedings of the 19th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["communication optimization", "federated learning", "multitask learning", "human activity recognition", "clustering"], "location": "Virtual Event, Wisconsin", "series": "MobiSys '21"}