{"authors": [{"first": "Xingyu", "last": "Chen"}, {"first": "Jia", "last": "Liu"}, {"first": "Fu", "last": "Xiao"}, {"first": "Shigang", "last": "Chen"}, {"first": "Lijun", "last": "Chen"}], "title": "Thermotag: Item-Level Temperature Sensing with a Passive RFID Tag", "year": "2021", "isbn": "9781450384438", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3458864.3467879", "doi": "10.1145/3458864.3467879", "abstract": "Temperature sensing plays a significant role in upholding quality assurance and meeting regulatory compliance in a wide variety of applications, such as fire safety and cold chain monitoring. However, existing temperature measurement devices are bulky, cost-prohibitive, or battery-powered, making item-level sensing and intelligence costly. In this paper, we present a novel tag-based thermometer called Thermotag, which uses a common passive RFID tag to sense the temperature with competitive advantages of being low-cost, battery-free, and robust to environmental conditions. The basic idea of Thermotag is that the resistance of a semiconductor diode in a tag's chip is temperature-sensitive. By measuring the discharging period through the reverse-polarized diode, we can estimate the temperature indirectly. We propose a standards-compliant measurement scheme of the discharging period by using a tag's volatile memory and build a mapping model between the discharging period and temperature for accurate and reliable temperature sensing. We implement Thermotag using a commercial off-the-shelf RFID system, with no need for any firmware or hardware modifications. Extensive experiments show that the temperature measurement has a large span ranging from 0 °C to 85 °C and a mean error of 2.7 °C.", "booktitle": "Proceedings of the 19th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "12", "keywords": ["persistence time", "passive RFID", "temperature sensing"], "location": "Virtual Event, Wisconsin", "series": "MobiSys '21"}