{"authors": [{"first": "Wen-Hsuan", "last": "Shen"}, {"first": "Hsin-Mu", "last": "Tsai"}], "title": "RayTrack: Enabling Interference-Free Outdoor Mobile VLC with Dynamic Field-of-View", "year": "2021", "isbn": "9781450384438", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3458864.3466867", "doi": "10.1145/3458864.3466867", "abstract": "Connected autonomous vehicles have boosted a high demand on communication throughput in order to timely share the information collected by in-car sensors (e.g., LiDAR). While visible light communication (VLC) has shown its capability to offer Gigabit-level throughput for applications with high demand for data rate, most are performed indoors and the throughput of outdoor VLC drops to a few Mbps. To fill this performance gap, this paper presents RayTrack, an interference-free outdoor mobile VLC system. The key idea of RayTrack is to use a small but real-time adjustable FOV according to the transmitter location, which can effectively repel interference from the environment and from other transmitters and boost the system throughput. The idea also realizes virtual point-to-point links, and eliminates the need of link access control. To be able to minimize the transmitter detection time to only 20 ms, RayTrack leverages a high-compression-ratio compressive sensing scheme, incorporating a dual-photodiode architecture, optimized measurement matrix and Gaussian-based basis to increase sparsity. Real-world driving experiments show that RayTrack is able to achieve a data rate of 607.9 kbps with over 90% detection accuracy and lower than 15% bit error rate at 35 m, with 70 - 100 km/hr driving speed. To the best of our knowledge, this is the first working outdoor VLC system which can offer such range, throughput and error performance while accommodating freeway mobility.", "booktitle": "Proceedings of the 19th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["visible light communication", "vehicular communication", "compressive sensing"], "location": "Virtual Event, Wisconsin", "series": "MobiSys '21"}