{"authors": [{"first": "Mikhail", "last": "Fomichev"}, {"first": "Julia", "last": "Hesse"}, {"first": "Lars", "last": "Almon"}, {"first": "Timm", "last": "Lippert"}, {"first": "Jun", "last": "Han"}, {"first": "Matthias", "last": "Hollick"}], "title": "FastZIP: Faster and More Secure Zero-Interaction Pairing", "year": "2021", "isbn": "9781450384438", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3458864.3467883", "doi": "10.1145/3458864.3467883", "abstract": "With the advent of the Internet of Things (IoT), establishing a secure channel between smart devices becomes crucial. Recent research proposes zero-interaction pairing (ZIP), which enables pairing without user assistance by utilizing devices' physical context (e.g., ambient audio) to obtain a shared secret key. The state-of-the-art ZIP schemes suffer from three limitations: (1) prolonged pairing time (i.e., minutes or hours), (2) vulnerability to brute-force offline attacks on a shared key, and (3) susceptibility to attacks caused by predictable context (e.g., replay attack) because they rely on limited entropy of physical context to protect a shared key. We address these limitations, proposing FastZIP, a novel ZIP scheme that significantly reduces pairing time while preventing offline and predictable context attacks. In particular, we adapt a recently introduced Fuzzy Password-Authenticated Key Exchange (fPAKE) protocol and utilize sensor fusion, maximizing their advantages. We instantiate FastZIP for intra-car device pairing to demonstrate its feasibility and show how the design of FastZIP can be adapted to other ZIP use cases. We implement FastZIP and evaluate it by driving four cars for a total of 800 km. We achieve up to three times shorter pairing time compared to the state-of-the-art ZIP schemes while assuring robust security with adversarial error rates below 0.5%.", "booktitle": "Proceedings of the 19th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["fPAKE", "pairing", "internet of things", "zero-interaction", "sensor fusion"], "location": "Virtual Event, Wisconsin", "series": "MobiSys '21"}