{"authors": [{"first": "Arjun", "last": "Balasingam"}, {"first": "Karthik", "last": "Gopalakrishnan"}, {"first": "Radhika", "last": "Mittal"}, {"first": "Venkat", "last": "Arun"}, {"first": "Ahmed", "last": "Saeed"}, {"first": "Mohammad", "last": "Alizadeh"}, {"first": "Hamsa", "last": "Balakrishnan"}, {"first": "Hari", "last": "Balakrishnan"}], "title": "Throughput-Fairness Tradeoffs in Mobility Platforms", "year": "2021", "isbn": "9781450384438", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3458864.3467881", "doi": "10.1145/3458864.3467881", "abstract": "This paper studies the problem of allocating tasks from different customers to vehicles in mobility platforms, which are used for applications like food and package delivery, ridesharing, and mobile sensing. A mobility platform should allocate tasks to vehicles and schedule them in order to optimize both throughput and fairness across customers. However, existing approaches to scheduling tasks in mobility platforms ignore fairness.We introduce Mobius, a system that uses guided optimization to achieve both high throughput and fairness across customers. Mobius supports spatiotemporally diverse and dynamic customer demands. It provides a principled method to navigate inherent tradeoffs between fairness and throughput caused by shared mobility. Our evaluation demonstrates these properties, along with the versatility and scalability of Mobius, using traces gathered from ridesharing and aerial sensing applications. Our ridesharing case study shows that Mobius can schedule more than 16,000 tasks across 40 customers and 200 vehicles in an online manner.", "booktitle": "Proceedings of the 19th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "13", "keywords": ["mobility platforms", "resource allocation", "ridesharing", "aerial sensing", "vehicle routing", "optimization"], "location": "Virtual Event, Wisconsin", "series": "MobiSys '21"}