{"authors": [{"first": "Fan", "last": "Mo"}, {"first": "Hamed", "last": "Haddadi"}, {"first": "Kleomenis", "last": "Katevas"}, {"first": "Eduard", "last": "Marin"}, {"first": "Diego", "last": "Perino"}, {"first": "Nicolas", "last": "Kourtellis"}], "title": "PPFL: Privacy-Preserving Federated Learning with Trusted Execution Environments", "year": "2021", "isbn": "9781450384438", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3458864.3466628", "doi": "10.1145/3458864.3466628", "abstract": "We propose and implement a Privacy-preserving Federated Learning (PPFL) framework for mobile systems to limit privacy leakages in federated learning. Leveraging the widespread presence of Trusted Execution Environments (TEEs) in high-end and mobile devices, we utilize TEEs on clients for local training, and on servers for secure aggregation, so that model/gradient updates are hidden from adversaries. Challenged by the limited memory size of current TEEs, we leverage greedy layer-wise training to train each model's layer inside the trusted area until its convergence. The performance evaluation of our implementation shows that PPFL can significantly improve privacy while incurring small system overheads at the client-side. In particular, PPFL can successfully defend the trained model against data reconstruction, property inference, and membership inference attacks. Furthermore, it can achieve comparable model utility with fewer communication rounds (0.54\\texttimes{}) and a similar amount of network traffic (1.002\\texttimes{}) compared to the standard federated learning of a complete model. This is achieved while only introducing up to ~15% CPU time, ~18% memory usage, and ~21% energy consumption overhead in PPFL's client-side.", "booktitle": "Proceedings of the 19th Annual International Conference on Mobile Systems, Applications, and Services", "numpages": "15", "location": "Virtual Event, Wisconsin", "series": "MobiSys '21"}