{"notes": [{"title": "BackFi: High Throughput WiFi Backscatter", "path": "../static/editor/notes/2785956.2787490.md", "papers": [{"authors": [{"first": "Dinesh", "last": "Bharadia"}, {"first": "Kiran Raj", "last": "Joshi"}, {"first": "Manikanta", "last": "Kotaru"}, {"first": "Sachin", "last": "Katti"}], "title": "BackFi: High Throughput WiFi Backscatter", "year": "2015", "isbn": "9781450335423", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/2785956.2787490", "doi": "10.1145/2785956.2787490", "abstract": "We present BackFi, a novel communication system that enables high throughput, long range communication between very low power backscatter devices and WiFi APs using ambient WiFi transmissions as the excitation signal. Specifically, we show that it is possible to design devices and WiFi APs such that the WiFi AP in the process of transmitting data to normal WiFi clients can decode backscatter signals which the devices generate by modulating information on to the ambient WiFi transmission. We show via prototypes and experiments that it is possible to achieve communication rates of up to 5 Mbps at a range of 1 m and 1 Mbps at a range of 5 meters. Such performance is an order to three orders of magnitude better than the best known prior WiFi backscatter system [27,25]. BackFi design is energy efficient, as it relies on backscattering alone and needs insignificant power, hence the energy consumed per bit is small.", "tags": ["ambient wifi transmissions", "long range communication", "normal wifi clients", "backscatter signals", "communication rates", "insignificant power", "high throughput", "backfi design", "information", "experiments", "prototypes", "magnitude", "wifi aps", "devices", "backfi", "data", "bit"], "booktitle": "Proceedings of the 2015 ACM Conference on Special Interest Group on Data Communication", "numpages": "14", "keywords": ["backscatter decoder", "wifi backscatter", "internet of things (iot)", "backscatter communication", "ambient backscatter", "full duplex backscatter"], "location": "London, United Kingdom", "series": "SIGCOMM '15"}]}, {"title": "WiFi Says \"Hi!\" Back to Strangers!", "path": "../static/editor/notes/3422604.3425951.md", "papers": [{"authors": [{"first": "Ali", "last": "Abedi"}, {"first": "Omid", "last": "Abari"}], "title": "WiFi Says \"Hi!\" Back to Strangers!", "year": "2020", "isbn": "9781450381451", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3422604.3425951", "doi": "10.1145/3422604.3425951", "abstract": "WiFi networks employ authentication and encryption mechanisms to protect the network from being accessed by unauthorized devices. Therefore, WiFi communication should be possible only between devices inside the same network. However, we have found that all existing WiFi devices send back acknowledgments (ACK) to even fake packets received from WiFi devices outside of their network. We call this behavior Polite WiFi since WiFi devices respond to all packets even those coming from strangers!In this paper, we discover the Polite WiFi behavior for the first time. We also examine this behavior on over 5,000 WiFi devices from 186 vendors. We find that all existing WiFi devices respond to fake packets transmitted to them. We believe this behavior creates many threats as well as opportunities. For example, one can couple this behavior with WiFi sensing and localization techniques to create a new class of security threats. In particular, by continuously sending fake frames to a target device, and measuring the properties of the ACK signal, one can extract sensitive personal information. Similarly, an attacker may use this behavior to quickly drain the battery of WiFi devices by continuously sending fake packets to them. Despite these threats, we also believe that the Polite WiFi behavior can open up new opportunities to WiFi sensing applications by making them more practical and easier to deploy.", "tags": ["sensitive personal information", "encryption mechanisms", "unauthorized devices", "wifi communication", "new opportunities", "security threats", "acknowledgments", "authentication", "wifi networks", "opportunities", "wifi devices", "strangers!in", "fake packets", "applications", "polite wifi", "fake frames", "devices", "ack"], "booktitle": "Proceedings of the 19th ACM Workshop on Hot Topics in Networks", "numpages": "7", "keywords": ["acknowledgment", "packet injection", "fake packet", "wifi sensing", "privacy", "threats", "security", "polite wifi"], "location": "Virtual Event, USA", "series": "HotNets '20"}]}, {"title": "Full Duplex Backscatter", "path": "../static/editor/notes/2535771.2535785.md", "papers": [{"authors": [{"first": "Dinesh", "last": "Bharadia"}, {"first": "Kiran Raj", "last": "Joshi"}, {"first": "Sachin", "last": "Katti"}], "title": "Full Duplex Backscatter", "year": "2013", "isbn": "9781450325967", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/2535771.2535785", "doi": "10.1145/2535771.2535785", "abstract": "This paper asks the following question: could we transform the radios found in our personal gadgets into powerful multipurpose scanning devices that can detect and locate tumors, guns, buried human bodies, a la the Star Trek Tricoder? Our key insight is that if radios could measure the backscatter of their own transmissions (i.e. reflections from the environment of their transmissions), then Tricorder-style powerful object detection and localization algorithms could be realized. In this paper we focus specifically on backscatter measurement, we describe novel circuits and algorithms that can be added to existing radios to enable them to accurately and concurrently receive and disentangle their own transmissions' reflections and infer its properties.", "tags": ["tricorder-style powerful object detection", "powerful multipurpose scanning devices", "localization algorithms", "backscatter measurement", "i.e. reflections", "novel circuits", "human bodies", "algorithms", "tumors", "radios", "guns"], "booktitle": "Proceedings of the Twelfth ACM Workshop on Hot Topics in Networks", "numpages": "7", "location": "College Park, Maryland", "series": "HotNets-XII"}]}, {"title": "WiTAG: Seamless WiFi Backscatter Communication", "path": "../static/editor/notes/3387514.3405866.md", "papers": [{"authors": [{"first": "Ali", "last": "Abedi"}, {"first": "Farzan", "last": "Dehbashi"}, {"first": "Mohammad Hossein", "last": "Mazaheri"}, {"first": "Omid", "last": "Abari"}, {"first": "Tim", "last": "Brecht"}], "title": "WiTAG: Seamless WiFi Backscatter Communication", "year": "2020", "isbn": "9781450379557", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/3387514.3405866", "doi": "10.1145/3387514.3405866", "abstract": "WiFi backscatter communication has the potential to enable battery-free sensors which can transmit data using a WiFi network. In order for WiFi backscatter systems to be practical they should be compatible with existing WiFi networks without any hardware or software modifications. Moreover, they should work with networks that use encryption. In this paper, we present WiTAG which achieves these requirements, making the implementation and deployment of WiFi backscatter communication more practical. In contrast with existing systems which utilize the physical layer for backscatter communication, we take a different approach by leveraging features of the MAC layer to communicate. WiTAG is designed to send data by selectively interfering with subframes (MPDUs) in an aggregated frame (A-MPDU). This enables standard compliant communication using modern, open or encrypted 802.11n and 802.11ac networks without requiring hardware or software modifications to any devices. We implement WiTAG using off-the-shelf components and evaluate its performance in line-of-sight and non-line-of-sight scenarios. We show that WiTAG achieves a throughput of up to 4 Kbps without impacting other devices in the network.", "tags": ["standard compliant communication", "wifi backscatter communication", "backscatter communication", "wifi backscatter systems", "battery-free sensors", "encryption", "deployment", "subframes", "the-shelf", "networks", "contrast", "features", "a-mpdu", "order", "witag", "mpdus", "sight", "data"], "booktitle": "Proceedings of the Annual Conference of the ACM Special Interest Group on Data Communication on the Applications, Technologies, Architectures, and Protocols for Computer Communication", "numpages": "13", "keywords": ["802.11 Networks", "Internet of Things (IoT)", "WiFi Backscatter", "Battery-free communication", "Sensors"], "location": "Virtual Event, USA", "series": "SIGCOMM '20"}]}, {"title": "Achieving Single Channel, Full Duplex Wireless Communication", "path": "../static/editor/notes/1859995.1859997.md", "papers": [{"authors": [{"first": "Jung Il", "last": "Choi"}, {"first": "Mayank", "last": "Jain"}, {"first": "Kannan", "last": "Srinivasan"}, {"first": "Phil", "last": "Levis"}, {"first": "Sachin", "last": "Katti"}], "title": "Achieving Single Channel, Full Duplex Wireless Communication", "year": "2010", "isbn": "9781450301817", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/1859995.1859997", "doi": "10.1145/1859995.1859997", "abstract": "This paper discusses the design of a single channel full-duplex wireless transceiver. The design uses a combination of RF and baseband techniques to achieve full-duplexing with minimal effect on link reliability. Experiments on real nodes show the full-duplex prototype achieves median performance that is within 8% of an ideal full-duplexing system.This paper presents Antenna Cancellation, a novel technique for self-interference cancellation. In conjunction with existing RF interference cancellation and digital baseband interference cancellation, antenna cancellation achieves the amount of self-interference cancellation required for full-duplex operation.The paper also discusses potential MAC and network gains with full-duplexing. It suggests ways in which a full-duplex system can solve some important problems with existing wireless systems including hidden terminals, loss of throughput due to congestion, and large end-to-end delays.", "tags": ["self-interference cancellation", "full-duplex operation", "antenna cancellation", "median performance", "link reliability", "digital baseband", "hidden terminals", "full-duplexing", "minimal effect", "potential mac", "network gains", "cancellation", "experiments", "conjunction", "techniques", "real nodes", "throughput", "congestion", "ways", "loss", "end", "rf"], "booktitle": "Proceedings of the Sixteenth Annual International Conference on Mobile Computing and Networking", "numpages": "12", "keywords": ["wireless full-duplex"], "location": "Chicago, Illinois, USA", "series": "MobiCom '10"}]}, {"title": "See through Walls with WiFi!", "path": "../static/editor/notes/2486001.2486039.md", "papers": [{"authors": [{"first": "Fadel", "last": "Adib"}, {"first": "Dina", "last": "Katabi"}], "title": "See through Walls with WiFi!", "year": "2013", "isbn": "9781450320566", "publisher": "Association for Computing Machinery", "address": "New York, NY, USA", "url": "https://doi.org/10.1145/2486001.2486039", "doi": "10.1145/2486001.2486039", "abstract": "Wi-Fi signals are typically information carriers between a transmitter and a receiver. In this paper, we show that Wi-Fi can also extend our senses, enabling us to see moving objects through walls and behind closed doors. In particular, we can use such signals to identify the number of people in a closed room and their relative locations. We can also identify simple gestures made behind a wall, and combine a sequence of gestures to communicate messages to a wireless receiver without carrying any transmitting device. The paper introduces two main innovations. First, it shows how one can use MIMO interference nulling to eliminate reflections off static objects and focus the receiver on a moving target. Second, it shows how one can track a human by treating the motion of a human body as an antenna array and tracking the resulting RF beam. We demonstrate the validity of our design by building it into USRP software radios and testing it in office buildings.", "tags": ["information carriers", "usrp software radios", "mimo interference", "office buildings", "simple gestures", "moving objects", "static objects", "wi-fi signals", "closed doors", "reflections", "gestures", "messages", "people", "wi-fi", "walls"], "booktitle": "Proceedings of the ACM SIGCOMM 2013 Conference on SIGCOMM", "numpages": "12", "keywords": ["wireless", "seeing through walls", "gesture-based user interface", "mimo"], "location": "Hong Kong, China", "series": "SIGCOMM '13"}]}]}